{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph, authenticate, Relationship\n",
    "authenticate(\"localhost:7474\", \"neo4j\", \"admin\")\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Les personnages qui apparaissent le plus souvent\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'c.name': u'SPIDER-MAN/PETER PAR'},\n",
       " {u'c.name': u'URICH, BEN'},\n",
       " {u'c.name': u'INVISIBLE WOMAN/SUE,'},\n",
       " {u'c.name': u'GALACTUS/GALAN'},\n",
       " {u'c.name': u'GAMBIT/REMY LEBEAU,'},\n",
       " {u'c.name': u'CAPTAIN MARVEL/CAPTA'},\n",
       " {u'c.name': u\"BLACK PANTHER/T'CHAL\"},\n",
       " {u'c.name': u'MEGGAN'},\n",
       " {u'c.name': u'MIRAGE II/DANIELLE M'},\n",
       " {u'c.name': u'KARNILLA [ASGARDIAN]'},\n",
       " {u'c.name': u'HAWK'},\n",
       " {u'c.name': u'SHANG-CHI'},\n",
       " {u'c.name': u'MAGIK/ILLYANA RASPUT'},\n",
       " {u'c.name': u'JAMESON, COL. JOHN,'},\n",
       " {u'c.name': u'DUGAN, TIMOTHY ALOYI'},\n",
       " {u'c.name': u'JUSTICE II/VANCE AST'},\n",
       " {u'c.name': u'NELSON, FRANKLIN FOG'},\n",
       " {u'c.name': u'LOKI [ASGARDIAN]'},\n",
       " {u'c.name': u'TRITON'},\n",
       " {u'c.name': u'KA-ZAR/KEVIN PLUNDER'},\n",
       " {u'c.name': u'SASQUATCH/WALTER LAN'},\n",
       " {u'c.name': u'BINARY/CAROL DANVERS'},\n",
       " {u'c.name': u'BISHOP /'},\n",
       " {u'c.name': u'FURY, COL. NICHOLAS,'},\n",
       " {u'c.name': u'CLEA'},\n",
       " {u'c.name': u'HUMAN TORCH/JOHNNY S'},\n",
       " {u'c.name': u'DAGGER/TANDY BOWEN'},\n",
       " {u'c.name': u'HULK/DR. ROBERT BRUC'},\n",
       " {u'c.name': u'CRYSTAL [INHUMAN]'},\n",
       " {u'c.name': u'QUASAR III/WENDELL V'},\n",
       " {u'c.name': u'LYJA LAZERFIST [SKRU'},\n",
       " {u'c.name': u'BALDER [ASGARDIAN]'},\n",
       " {u'c.name': u'DR. DOOM/VICTOR VON,'},\n",
       " {u'c.name': u'THOR/DR. DONALD BLAK'},\n",
       " {u'c.name': u'BOOMER/TABITHA SMITH'},\n",
       " {u'c.name': u'SANDMAN/WILLIAM BAKE'},\n",
       " {u'c.name': u'ROBERTSON, JOE'},\n",
       " {u'c.name': u'STORM/ORORO MUNROE S'},\n",
       " {u'c.name': u'SIF'},\n",
       " {u'c.name': u'USAGENT/CAPTAIN JOHN'},\n",
       " {u'c.name': u'FORGE'},\n",
       " {u'c.name': u'HOGUN [ASGARDIAN]'},\n",
       " {u'c.name': u'KINGPIN/WILSON FISK'},\n",
       " {u'c.name': u'LOCKJAW [INHUMAN]'},\n",
       " {u'c.name': u'CAPTAIN BRITAIN/BRIA'},\n",
       " {u'c.name': u'CYCLOPS/SCOTT SUMMER'},\n",
       " {u'c.name': u'FANDRAL [ASGARDIAN]'},\n",
       " {u'c.name': u'OSBORN, LIZ ALLAN'},\n",
       " {u'c.name': u'MAN-THING/THEODORE T'},\n",
       " {u'c.name': u'SPIDER-MAN CLONE/BEN'},\n",
       " {u'c.name': u'GHOST RIDER II/JOHNN'},\n",
       " {u'c.name': u'NORTHSTAR/JEAN-PAUL,'},\n",
       " {u'c.name': u'TALBOT, GLENN'},\n",
       " {u'c.name': u'PROFESSOR X/CHARLES,'},\n",
       " {u'c.name': u\"SHANNA/SHANNA O'HARA\"},\n",
       " {u'c.name': u'DR. OCTOPUS/OTTO OCT'},\n",
       " {u'c.name': u'BLACK CAT/FELICIA HA'},\n",
       " {u'c.name': u'CARTER, SHARON'},\n",
       " {u'c.name': u'COLOSSUS II/PETER RA'},\n",
       " {u'c.name': u'WONDER MAN/SIMON WIL'},\n",
       " {u'c.name': u'GEE/ALEX POWER'},\n",
       " {u'c.name': u'SCARLET WITCH/WANDA,'},\n",
       " {u'c.name': u'NIGHTHAWK II/KYLE RI'},\n",
       " {u'c.name': u'HEIMDALL [ASGARDIAN]'},\n",
       " {u'c.name': u'HOGAN, VIRGINIA PEPP'},\n",
       " {u'c.name': u'JONES, GABE'},\n",
       " {u'c.name': u'HERCULES [GREEK GOD]'},\n",
       " {u'c.name': u'KINCAID, DR. JANE FO'},\n",
       " {u'c.name': u'IRON MAN/TONY STARK,'},\n",
       " {u'c.name': u'MOON KNIGHT/MARC SPE'},\n",
       " {u'c.name': u'WONG'},\n",
       " {u'c.name': u'MEPHISTO'},\n",
       " {u'c.name': u'IRON FIST/DANIEL RAN'},\n",
       " {u'c.name': u'NIGHTCRAWLER/KURT WA'},\n",
       " {u'c.name': u'NORRISS, SISTER BARB'},\n",
       " {u'c.name': u'WATSON-PARKER, MARY,'},\n",
       " {u'c.name': u'BLACK BOLT/BLACKANTO'},\n",
       " {u'c.name': u'WASP/JANET VAN DYNE,'},\n",
       " {u'c.name': u'JONES, RICHARD MILHO'},\n",
       " {u'c.name': u'ANT-MAN II/SCOTT HAR'},\n",
       " {u'c.name': u'PHARAOH RAMA-TUT'},\n",
       " {u'c.name': u'RICHARDS, FRANKLIN B'},\n",
       " {u'c.name': u'RED SKULL/JOHANN SCH'},\n",
       " {u'c.name': u'BANNER, BETTY ROSS T'},\n",
       " {u'c.name': u'HUDSON, HEATHER'},\n",
       " {u'c.name': u'PHOENIX III/RACHEL S'},\n",
       " {u'c.name': u'MARVEL GIRL/JEAN GRE'},\n",
       " {u'c.name': u'MEDUSA/MEDUSALITH AM'},\n",
       " {u'c.name': u'DR. STRANGE/STEPHEN,'},\n",
       " {u'c.name': u'ZABU'},\n",
       " {u'c.name': u'WATSON, ANNA'},\n",
       " {u'c.name': u'SIRYN/THERESA ROURKE'},\n",
       " {u'c.name': u'WOLVERINE/LOGAN,'},\n",
       " {u'c.name': u'THOMPSON, EUGENE FLA'},\n",
       " {u'c.name': u'PSYLOCKE/ELISABETH B'},\n",
       " {u'c.name': u'BEAST/HENRY &HANK& P'},\n",
       " {u'c.name': u'THUNDERSTRIKE/ERIC K'},\n",
       " {u'c.name': u'BANSHEE/SEAN CASSIDY'},\n",
       " {u'c.name': u'FIRESTAR/ANGELICA JO'},\n",
       " {u'c.name': u'HOGAN, HAROLD J. HAP'},\n",
       " {u'c.name': u'BLACK KNIGHT V/DANE,'},\n",
       " {u'c.name': u'CANNONBALL II/SAM GU'},\n",
       " {u'c.name': u'PUCK/EUGENE MILTON J'},\n",
       " {u'c.name': u'THUNDERBIRD II/JAMES'},\n",
       " {u'c.name': u'FALCON/SAM WILSON'},\n",
       " {u'c.name': u'WOLFSBANE/RAHNE SINC'},\n",
       " {u'c.name': u'GRANT, GLORIA GLORY'},\n",
       " {u'c.name': u'SUNSPOT/ROBERTO DACO'},\n",
       " {u'c.name': u'OSBORN, HARRY'},\n",
       " {u'c.name': u'JUBILEE/JUBILATION L'},\n",
       " {u'c.name': u'SHADOWCAT/KATHERINE,'},\n",
       " {u'c.name': u'STARFOX/EROS'},\n",
       " {u'c.name': u'CAPTAIN MARVEL II/MO'},\n",
       " {u'c.name': u'AURORA/JEANNE-MARIE,'},\n",
       " {u'c.name': u'HELLCAT/PATSY WALKER'},\n",
       " {u'c.name': u'ODIN [ASGARDIAN]'},\n",
       " {u'c.name': u'WHITE QUEEN/EMMA FRO'},\n",
       " {u'c.name': u'ANGEL/WARREN KENNETH'},\n",
       " {u'c.name': u'SPIDER-WOMAN II/JULI'},\n",
       " {u'c.name': u'SUB-MARINER/NAMOR MA'},\n",
       " {u'c.name': u'SUMMERS, NATHAN CHRI'},\n",
       " {u'c.name': u'ENCHANTRESS/AMORA/HE'},\n",
       " {u'c.name': u'CLOAK/TYRONE JOHNSON'},\n",
       " {u'c.name': u'MAGNETO/MAGNUS/ERIC,'},\n",
       " {u'c.name': u'JAMESON, J. JONAH'},\n",
       " {u'c.name': u'COOPER, DR. VALERIE'},\n",
       " {u'c.name': u'CAGE, LUKE/CARL LUCA'},\n",
       " {u'c.name': u'SERSI/SYLVIA'},\n",
       " {u'c.name': u'DAZZLER II/ALLISON B'},\n",
       " {u'c.name': u'NOVA/RICHARD RIDER'},\n",
       " {u'c.name': u'ICEMAN/ROBERT BOBBY,'},\n",
       " {u'c.name': u'MYSTIQUE/RAVEN DARKH'},\n",
       " {u'c.name': u'LOCKHEED'},\n",
       " {u'c.name': u'HUMAN TORCH ANDROID/'},\n",
       " {u'c.name': u'JARVIS, EDWIN,'},\n",
       " {u'c.name': u'IRON MAN IV/JAMES R.'},\n",
       " {u'c.name': u'PARKER, MAY'},\n",
       " {u'c.name': u'ANT-MAN/DR. HENRY J.'},\n",
       " {u'c.name': u'DAREDEVIL/MATT MURDO'},\n",
       " {u'c.name': u'VOLSTAGG'},\n",
       " {u'c.name': u'VISION,'},\n",
       " {u'c.name': u'HAVOK/ALEX SUMMERS,'},\n",
       " {u'c.name': u'ROSS, GEN. THADDEUS,'},\n",
       " {u'c.name': u'LEEDS, BETTY BRANT'},\n",
       " {u'c.name': u'NAMORITA/NITA PRENTI'},\n",
       " {u'c.name': u'QUICKSILVER/PIETRO M'},\n",
       " {u'c.name': u'SHE-HULK/JENNIFER WA'},\n",
       " {u'c.name': u'MASTERS, ALICIA REIS'},\n",
       " {u'c.name': u'WARLOCK III'},\n",
       " {u'c.name': u'GORGON [INHUMAN]'},\n",
       " {u'c.name': u'MOONDRAGON/HEATHER D'},\n",
       " {u'c.name': u'KNIGHT, MISTY'},\n",
       " {u'c.name': u'ROGUE /'},\n",
       " {u'c.name': u'MOCKINGBIRD/DR. BARB'},\n",
       " {u'c.name': u'CAPTAIN AMERICA'},\n",
       " {u'c.name': u'PAGE, KAREN'},\n",
       " {u'c.name': u'SHAMAN/MICHAEL TWOYO'},\n",
       " {u'c.name': u'SILVER SURFER/NORRIN'},\n",
       " {u'c.name': u'TIGRA/GREER NELSON'},\n",
       " {u'c.name': u'SPIDER-WOMAN/JESSICA'},\n",
       " {u'c.name': u'GHOST RIDER III/DAN,'},\n",
       " {u'c.name': u'BLACK WIDOW/NATASHA,'},\n",
       " {u'c.name': u'CYPHER/DOUG RAMSEY'},\n",
       " {u'c.name': u'DRACULA/VLAD TEPES'},\n",
       " {u'c.name': u'PUNISHER II/FRANK CA'},\n",
       " {u'c.name': u'DOC SAMSON/DR. LEONA'},\n",
       " {u'c.name': u'KARNAK [INHUMAN]'},\n",
       " {u'c.name': u'POLARIS/LORNA DANE'},\n",
       " {u'c.name': u'MR. FANTASTIC/REED R'},\n",
       " {u'c.name': u'TARR, BLACK JACK'},\n",
       " {u'c.name': u'MACTAGGERT, MOIRA KI'},\n",
       " {u'c.name': u'UATU'},\n",
       " {u'c.name': u'SPEEDBALL/ROBBIE BAL'},\n",
       " {u'c.name': u'THING/BENJAMIN J. GR'}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run('''\n",
    "MATCH (c: character) -[r:APPEARS_IN]-> (:comics)\n",
    "WITH count(r)  as res, c\n",
    "WHERE  res > 100\n",
    "RETURN c.name \n",
    "''').data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Relation nommée (peut être réutilisée): APPEARS_IN \n",
    "On compte le nombre de comics dans lequels apparait chaque perso\n",
    "Retour par ordre decroissant\n",
    "dans la limite de 10 occurences"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'nbOccurrences': 1625, u'superheros': u'SPIDER-MAN/PETER PAR'},\n",
       " {u'nbOccurrences': 1367, u'superheros': u'CAPTAIN AMERICA'},\n",
       " {u'nbOccurrences': 1168, u'superheros': u'IRON MAN/TONY STARK,'},\n",
       " {u'nbOccurrences': 990, u'superheros': u'THING/BENJAMIN J. GR'},\n",
       " {u'nbOccurrences': 965, u'superheros': u'THOR/DR. DONALD BLAK'},\n",
       " {u'nbOccurrences': 908, u'superheros': u'HUMAN TORCH/JOHNNY S'},\n",
       " {u'nbOccurrences': 875, u'superheros': u'MR. FANTASTIC/REED R'},\n",
       " {u'nbOccurrences': 841, u'superheros': u'HULK/DR. ROBERT BRUC'},\n",
       " {u'nbOccurrences': 820, u'superheros': u'WOLVERINE/LOGAN,'},\n",
       " {u'nbOccurrences': 782, u'superheros': u'INVISIBLE WOMAN/SUE,'}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run('''\n",
    "MATCH (c: character) -[r:APPEARS_IN]-> (:comics)\n",
    "WITH count(r)  as res, c\n",
    "ORDER BY res DESC\n",
    "RETURN c.name as superheros, res as nbOccurrences  LIMIT 10\n",
    "''').data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Le nombre moyen de personnages par comics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[[],\n",
       " [],\n",
       " [{u'c': (de8af7e:comics {name:\"AA2 35\",number:\"6487\"})},\n",
       "  {u'c': (de8af7e:comics {name:\"AA2 35\",number:\"6487\"})},\n",
       "  {u'c': (de8af7e:comics {name:\"AA2 35\",number:\"6487\"})},\n",
       "  {u'c': (de8af7e:comics {name:\"AA2 35\",number:\"6487\"})},\n",
       "  {u'c': (de8af7e:comics {name:\"AA2 35\",number:\"6487\"})},\n",
       "  {u'c': (de8af7e:comics {name:\"AA2 35\",number:\"6487\"})}],\n",
       " [{u'c': (ed9caaa:comics {name:\"M/PRM 35\",number:\"6488\"})}],\n",
       " [{u'c': (e3be7ea:comics {name:\"M/PRM 36\",number:\"6489\"})}]]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "maList = []\n",
    "# Parcours des comics\n",
    "for index in range (6485,6490):\n",
    "    # On teste tous les perso pour leur relation avec le comics designé par l'index\n",
    "    maList.append(\n",
    "    graph.run('''\n",
    "    MATCH (:character) -[r: APPEARS_IN]-> (c: comics)\n",
    "    WHERE c.number = {I}\n",
    "    RETURN c\n",
    "    ''', {\"I\":str(index)}).data())\n",
    "maList"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[[{u'res': 0}], [{u'res': 0}], [{u'res': 6}], [{u'res': 1}], [{u'res': 1}]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "maList = []\n",
    "for index in range (6485,6490):\n",
    "    maList.append(\n",
    "        # Meme idee, mais au lieu de renvoyer une ligne par correspondance, \n",
    "        # on compte le nombre de relations equivalentes (un perso quelconque apparait dans ce comics particulier)\n",
    "    graph.run('''\n",
    "    MATCH (:character) -[r: APPEARS_IN]-> (c: comics {number :{I}} )\n",
    "    WITH count(r)  as res\n",
    "    RETURN  res\n",
    "    ''', {\"I\":str(index)}).data())\n",
    "maList\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "maList = []\n",
    "for index in range (6400,7000):\n",
    "    maList.append(\n",
    "         # On peut ecrire la relation dans l'autre sens,\n",
    "        # en comptant le nombre de fois que le comics est impliqué dans une relation APPEARS_IN\n",
    "        # les characters n'ont pas besoin d'être explicités\n",
    "    graph.run('''\n",
    "    MATCH (c: comics {number :{I}}) <-[r: APPEARS_IN]- ()  \n",
    "    WITH count(r)  as res, c\n",
    "    RETURN  res, c.name LIMIT 10\n",
    "    ''', {\"I\":str(index)}).data())\n",
    "    \n",
    "# on obtient une liste de listes de dictionnaire\n",
    "#  Utilisation de la comprehension de liste\n",
    "# new_list = [function(item) for item in list if condition(item)]    \n",
    "newList = [item for sublist in maList for  item in sublist]\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[0, 0, 6, 1, 1]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# puis recuperer chaque item dans une liste\n",
    "list3 = [item[u'res'] for item in newList]\n",
    "list3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Rassembler le tout dans une fonction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1.6000000000000001"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "np.asarray(list3).mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'c.name': u'COC 1', u'res': 111},\n",
       " {u'c.name': u'H2 278', u'res': 53},\n",
       " {u'c.name': u\"MX '01\", u'res': 49},\n",
       " {u'c.name': u'ROM 65', u'res': 42},\n",
       " {u'c.name': u'SWII 7', u'res': 41},\n",
       " {u'c.name': u'M/SHSW 12', u'res': 38},\n",
       " {u'c.name': u'M/SHSW 11', u'res': 36},\n",
       " {u'c.name': u'M/SHSW 7', u'res': 36},\n",
       " {u'c.name': u'AR 2', u'res': 35},\n",
       " {u'c.name': u'M/SHSW 1', u'res': 35},\n",
       " {u'c.name': u'M/SHSW 3', u'res': 35},\n",
       " {u'c.name': u'M/SHSW 4', u'res': 35},\n",
       " {u'c.name': u'M/SHSW 6', u'res': 35},\n",
       " {u'c.name': u'M/SHSW 8', u'res': 35},\n",
       " {u'c.name': u'Q 25', u'res': 35},\n",
       " {u'c.name': u'M/SHSW 2', u'res': 34},\n",
       " {u'c.name': u'M/SHSW 5', u'res': 33},\n",
       " {u'c.name': u'T 291', u'res': 31},\n",
       " {u'c.name': u'T 300', u'res': 31},\n",
       " {u'c.name': u'M/SHSW 10', u'res': 30},\n",
       " {u'c.name': u'UX 377', u'res': 30},\n",
       " {u'c.name': u'UX@ 10', u'res': 30},\n",
       " {u'c.name': u'NW 9', u'res': 29},\n",
       " {u'c.name': u\"IM '99\", u'res': 28},\n",
       " {u'c.name': u'M/SHSW 9', u'res': 28},\n",
       " {u'c.name': u'UX 223', u'res': 28},\n",
       " {u'c.name': u'FF@ 23', u'res': 27},\n",
       " {u'c.name': u'IM3 1', u'res': 27},\n",
       " {u'c.name': u'Q 14', u'res': 27},\n",
       " {u'c.name': u'X 96', u'res': 27},\n",
       " {u'c.name': u'A:T', u'res': 26},\n",
       " {u'c.name': u'T 301', u'res': 26},\n",
       " {u'c.name': u'UX 227', u'res': 26},\n",
       " {u'c.name': u'AUP 4', u'res': 25},\n",
       " {u'c.name': u'FF 402', u'res': 24},\n",
       " {u'c.name': u'ROM 66', u'res': 24},\n",
       " {u'c.name': u'UX@ 14', u'res': 24},\n",
       " {u'c.name': u'GAM3 17', u'res': 23},\n",
       " {u'c.name': u'GAM3 22', u'res': 23},\n",
       " {u'c.name': u'NW 55', u'res': 23},\n",
       " {u'c.name': u'NW 65', u'res': 23},\n",
       " {u'c.name': u'T2 14', u'res': 23},\n",
       " {u'c.name': u'X 97', u'res': 23},\n",
       " {u'c.name': u'XFOR 10', u'res': 23},\n",
       " {u'c.name': u'H2 399', u'res': 22},\n",
       " {u'c.name': u'NW 8', u'res': 22},\n",
       " {u'c.name': u'UX 199', u'res': 22},\n",
       " {u'c.name': u'UX 226', u'res': 22},\n",
       " {u'c.name': u'W2 164', u'res': 22},\n",
       " {u'c.name': u'XF@ 5', u'res': 22},\n",
       " {u'c.name': u'BP3 27', u'res': 21},\n",
       " {u'c.name': u'MAXSEC:DP', u'res': 21},\n",
       " {u'c.name': u'MK3 44', u'res': 21},\n",
       " {u'c.name': u'XF 40', u'res': 21},\n",
       " {u'c.name': u'A 274', u'res': 20},\n",
       " {u'c.name': u'A 275', u'res': 20},\n",
       " {u'c.name': u'E:HEROD', u'res': 20},\n",
       " {u'c.name': u'GENX 42', u'res': 20},\n",
       " {u'c.name': u'H2 397', u'res': 20},\n",
       " {u'c.name': u'T 440', u'res': 20},\n",
       " {u'c.name': u'UX 225', u'res': 20},\n",
       " {u'c.name': u'A 273', u'res': 19},\n",
       " {u'c.name': u'BP3 16', u'res': 19},\n",
       " {u'c.name': u'C2 80', u'res': 19},\n",
       " {u'c.name': u'N@ 1/3', u'res': 19},\n",
       " {u'c.name': u'NM@ 2', u'res': 19},\n",
       " {u'c.name': u'NW 56', u'res': 19},\n",
       " {u'c.name': u'NW 7', u'res': 19},\n",
       " {u'c.name': u'NW2 1', u'res': 19},\n",
       " {u'c.name': u'T2 12', u'res': 19},\n",
       " {u'c.name': u'UX 355', u'res': 19},\n",
       " {u'c.name': u'AA2 2', u'res': 18},\n",
       " {u'c.name': u'ABOM 3', u'res': 18},\n",
       " {u'c.name': u'C2 81', u'res': 18},\n",
       " {u'c.name': u'C2 84', u'res': 18},\n",
       " {u'c.name': u'FFU 11', u'res': 18},\n",
       " {u'c.name': u'H2 423', u'res': 18},\n",
       " {u'c.name': u'HFH 17', u'res': 18},\n",
       " {u'c.name': u'JIM 508', u'res': 18},\n",
       " {u'c.name': u'N 58', u'res': 18},\n",
       " {u'c.name': u'NW 62', u'res': 18},\n",
       " {u'c.name': u'NW2 5', u'res': 18},\n",
       " {u'c.name': u'Q 16', u'res': 18},\n",
       " {u'c.name': u'UX 221', u'res': 18},\n",
       " {u'c.name': u'UX 222', u'res': 18},\n",
       " {u'c.name': u'UX 224', u'res': 18},\n",
       " {u'c.name': u'UX 353', u'res': 18},\n",
       " {u'c.name': u'XCAL 107', u'res': 18},\n",
       " {u'c.name': u'ASM@ 23', u'res': 17},\n",
       " {u'c.name': u'ASPOT 29/2', u'res': 17},\n",
       " {u'c.name': u'BP3 23', u'res': 17},\n",
       " {u'c.name': u'C2 83', u'res': 17},\n",
       " {u'c.name': u'E2 10', u'res': 17},\n",
       " {u'c.name': u'E2 5', u'res': 17},\n",
       " {u'c.name': u'FF 83', u'res': 17},\n",
       " {u'c.name': u'H2 391', u'res': 17},\n",
       " {u'c.name': u'INH 5', u'res': 17},\n",
       " {u'c.name': u'NW 74', u'res': 17},\n",
       " {u'c.name': u'NW2 4', u'res': 17},\n",
       " {u'c.name': u'ROM 24', u'res': 17},\n",
       " {u'c.name': u'XF 41', u'res': 17},\n",
       " {u'c.name': u'XFOR 73', u'res': 17},\n",
       " {u'c.name': u'A 248', u'res': 16},\n",
       " {u'c.name': u'ASM 429', u'res': 16},\n",
       " {u'c.name': u'BP3 17', u'res': 16},\n",
       " {u'c.name': u'BP3 9', u'res': 16},\n",
       " {u'c.name': u'C2 82', u'res': 16},\n",
       " {u'c.name': u'E2 9', u'res': 16},\n",
       " {u'c.name': u'FF3 3', u'res': 16},\n",
       " {u'c.name': u'H2 395', u'res': 16},\n",
       " {u'c.name': u'H2 398', u'res': 16},\n",
       " {u'c.name': u'INH 4', u'res': 16},\n",
       " {u'c.name': u'N 8', u'res': 16},\n",
       " {u'c.name': u'NO2 14', u'res': 16},\n",
       " {u'c.name': u'NW 54', u'res': 16},\n",
       " {u'c.name': u'NW 71', u'res': 16},\n",
       " {u'c.name': u'NW2 7', u'res': 16},\n",
       " {u'c.name': u'T 448', u'res': 16},\n",
       " {u'c.name': u'T2 9', u'res': 16},\n",
       " {u'c.name': u'TB 45', u'res': 16},\n",
       " {u'c.name': u'WOSM 73', u'res': 16},\n",
       " {u'c.name': u'XCAL 108', u'res': 16},\n",
       " {u'c.name': u'BP3 33', u'res': 15},\n",
       " {u'c.name': u'BP3 7', u'res': 15},\n",
       " {u'c.name': u'BP3 8', u'res': 15},\n",
       " {u'c.name': u'CM4 2', u'res': 15},\n",
       " {u'c.name': u'DRSTR3 49', u'res': 15},\n",
       " {u'c.name': u'FF 204', u'res': 15},\n",
       " {u'c.name': u'FF 411', u'res': 15},\n",
       " {u'c.name': u'FF 413', u'res': 15},\n",
       " {u'c.name': u'FF 47', u'res': 15},\n",
       " {u'c.name': u'FF3 4', u'res': 15},\n",
       " {u'c.name': u'GAM3 14', u'res': 15},\n",
       " {u'c.name': u'H2 421', u'res': 15},\n",
       " {u'c.name': u'H@ 18/2', u'res': 15},\n",
       " {u'c.name': u'N 13', u'res': 15},\n",
       " {u'c.name': u'N 55', u'res': 15},\n",
       " {u'c.name': u'NW 29', u'res': 15},\n",
       " {u'c.name': u'NW 69', u'res': 15},\n",
       " {u'c.name': u'NW2 6', u'res': 15},\n",
       " {u'c.name': u'T 447', u'res': 15},\n",
       " {u'c.name': u'T2 26', u'res': 15},\n",
       " {u'c.name': u'T@ 7', u'res': 15},\n",
       " {u'c.name': u'X 77', u'res': 15},\n",
       " {u'c.name': u'XCAL 52', u'res': 15},\n",
       " {u'c.name': u'XCAL 58', u'res': 15},\n",
       " {u'c.name': u'A 183', u'res': 14},\n",
       " {u'c.name': u'A 260', u'res': 14},\n",
       " {u'c.name': u'AA2 1', u'res': 14},\n",
       " {u'c.name': u'AA2 28', u'res': 14},\n",
       " {u'c.name': u'ASM 283', u'res': 14},\n",
       " {u'c.name': u'BP3 22', u'res': 14},\n",
       " {u'c.name': u'BP3 24', u'res': 14},\n",
       " {u'c.name': u'CA3 21', u'res': 14},\n",
       " {u'c.name': u'DPOOL3 44', u'res': 14},\n",
       " {u'c.name': u'FF 206', u'res': 14},\n",
       " {u'c.name': u'FF 209', u'res': 14},\n",
       " {u'c.name': u'H2 209', u'res': 14},\n",
       " {u'c.name': u'H2 379', u'res': 14},\n",
       " {u'c.name': u'H2 392', u'res': 14},\n",
       " {u'c.name': u'H2 400', u'res': 14},\n",
       " {u'c.name': u'HAWK2', u'res': 14},\n",
       " {u'c.name': u'IM@ 6', u'res': 14},\n",
       " {u'c.name': u'INH 6', u'res': 14},\n",
       " {u'c.name': u'N 17', u'res': 14},\n",
       " {u'c.name': u'NM@ 6', u'res': 14},\n",
       " {u'c.name': u'NW 30', u'res': 14},\n",
       " {u'c.name': u'NW2 10', u'res': 14},\n",
       " {u'c.name': u'SSWP 7', u'res': 14},\n",
       " {u'c.name': u'T 383', u'res': 14},\n",
       " {u'c.name': u'T2 25', u'res': 14},\n",
       " {u'c.name': u'UX 188', u'res': 14},\n",
       " {u'c.name': u'W2 53', u'res': 14},\n",
       " {u'c.name': u'A 184', u'res': 13},\n",
       " {u'c.name': u'AA2 31', u'res': 13},\n",
       " {u'c.name': u'ABOM 1', u'res': 13},\n",
       " {u'c.name': u'ABOM 2', u'res': 13},\n",
       " {u'c.name': u'E 11', u'res': 13},\n",
       " {u'c.name': u'E2 7', u'res': 13},\n",
       " {u'c.name': u'FF 208', u'res': 13},\n",
       " {u'c.name': u'H2 425', u'res': 13},\n",
       " {u'c.name': u'IM 327', u'res': 13},\n",
       " {u'c.name': u'N 18', u'res': 13},\n",
       " {u'c.name': u'N 19', u'res': 13},\n",
       " {u'c.name': u'N 26', u'res': 13},\n",
       " {u'c.name': u'N 56', u'res': 13},\n",
       " {u'c.name': u'NW2 2', u'res': 13},\n",
       " {u'c.name': u'NW2 9', u'res': 13},\n",
       " {u'c.name': u'T 216', u'res': 13},\n",
       " {u'c.name': u'T2 10', u'res': 13},\n",
       " {u'c.name': u'UX 356', u'res': 13},\n",
       " {u'c.name': u'W2 51', u'res': 13},\n",
       " {u'c.name': u'XCAL 109', u'res': 13},\n",
       " {u'c.name': u'XCAL 57', u'res': 13},\n",
       " {u'c.name': u'XFOR 72', u'res': 13},\n",
       " {u'c.name': u'A 270', u'res': 12},\n",
       " {u'c.name': u'AA2 27', u'res': 12},\n",
       " {u'c.name': u'AA2 29', u'res': 12},\n",
       " {u'c.name': u'BP3 6', u'res': 12},\n",
       " {u'c.name': u'C2 61', u'res': 12},\n",
       " {u'c.name': u'C2 79', u'res': 12},\n",
       " {u'c.name': u'DRSTR3 48', u'res': 12},\n",
       " {u'c.name': u'DRSTR3 7', u'res': 12},\n",
       " {u'c.name': u'E 12', u'res': 12},\n",
       " {u'c.name': u\"FF '01\", u'res': 12},\n",
       " {u'c.name': u'FF3 40', u'res': 12},\n",
       " {u'c.name': u'H2 119', u'res': 12},\n",
       " {u'c.name': u'H2 381', u'res': 12},\n",
       " {u'c.name': u'H2 382', u'res': 12},\n",
       " {u'c.name': u'H2 386', u'res': 12},\n",
       " {u'c.name': u'H2 422', u'res': 12},\n",
       " {u'c.name': u'I:GR', u'res': 12},\n",
       " {u'c.name': u'IM 326', u'res': 12},\n",
       " {u'c.name': u'INHUMANS GRAPHIC NOV', u'res': 12},\n",
       " {u'c.name': u'INV 26', u'res': 12},\n",
       " {u'c.name': u'INV@ 1', u'res': 12},\n",
       " {u'c.name': u'N 16', u'res': 12},\n",
       " {u'c.name': u'NW 53', u'res': 12},\n",
       " {u'c.name': u'NW2 3', u'res': 12},\n",
       " {u'c.name': u'SS 18', u'res': 12},\n",
       " {u'c.name': u'SS3 112', u'res': 12},\n",
       " {u'c.name': u'T 206', u'res': 12},\n",
       " {u'c.name': u'T 208', u'res': 12},\n",
       " {u'c.name': u'T 284', u'res': 12},\n",
       " {u'c.name': u'T 375', u'res': 12},\n",
       " {u'c.name': u'T 376', u'res': 12},\n",
       " {u'c.name': u'T2 5', u'res': 12},\n",
       " {u'c.name': u'UX 357', u'res': 12},\n",
       " {u'c.name': u'XCAL 110', u'res': 12},\n",
       " {u'c.name': u'XFOR 54', u'res': 12},\n",
       " {u'c.name': u'XFOR 74', u'res': 12},\n",
       " {u'c.name': u'AA2 23', u'res': 11},\n",
       " {u'c.name': u'AA2 24', u'res': 11},\n",
       " {u'c.name': u'AVF 4', u'res': 11},\n",
       " {u'c.name': u'AVF 5', u'res': 11},\n",
       " {u'c.name': u'BP3 12', u'res': 11},\n",
       " {u'c.name': u'BP3 18', u'res': 11},\n",
       " {u'c.name': u'BP3 20', u'res': 11},\n",
       " {u'c.name': u'BP3 25', u'res': 11},\n",
       " {u'c.name': u'BP3 5', u'res': 11},\n",
       " {u'c.name': u'C2 60', u'res': 11},\n",
       " {u'c.name': u'CAGE 9', u'res': 11},\n",
       " {u'c.name': u'CM 51', u'res': 11},\n",
       " {u'c.name': u'DAZZ 18', u'res': 11},\n",
       " {u'c.name': u'DB 1', u'res': 11},\n",
       " {u'c.name': u'DRSTR3 32', u'res': 11},\n",
       " {u'c.name': u'DRSTR3 43', u'res': 11},\n",
       " {u'c.name': u'DRSTR3 6', u'res': 11},\n",
       " {u'c.name': u'E 3', u'res': 11},\n",
       " {u'c.name': u'E2 2', u'res': 11},\n",
       " {u'c.name': u'H2 366', u'res': 11},\n",
       " {u'c.name': u'H2 383', u'res': 11},\n",
       " {u'c.name': u'H2 393', u'res': 11},\n",
       " {u'c.name': u'H2 448', u'res': 11},\n",
       " {u'c.name': u'H2 456', u'res': 11},\n",
       " {u'c.name': u'H@ 1', u'res': 11},\n",
       " {u'c.name': u'INH2 1', u'res': 11},\n",
       " {u'c.name': u'LSHOT 5', u'res': 11},\n",
       " {u'c.name': u'N 15', u'res': 11},\n",
       " {u'c.name': u'NW2 8', u'res': 11},\n",
       " {u'c.name': u'SLEEP 19', u'res': 11},\n",
       " {u'c.name': u'T 214', u'res': 11},\n",
       " {u'c.name': u'T 215', u'res': 11},\n",
       " {u'c.name': u'T2 11', u'res': 11},\n",
       " {u'c.name': u'T2 7', u'res': 11},\n",
       " {u'c.name': u'T2 8', u'res': 11},\n",
       " {u'c.name': u'T@ 2', u'res': 11},\n",
       " {u'c.name': u'W2 52', u'res': 11},\n",
       " {u'c.name': u'X 38', u'res': 11},\n",
       " {u'c.name': u'X 74', u'res': 11},\n",
       " {u'c.name': u'XF 76', u'res': 11},\n",
       " {u'c.name': u'XFOR 108', u'res': 11},\n",
       " {u'c.name': u'XFOR 109', u'res': 11},\n",
       " {u'c.name': u'XFOR 53', u'res': 11},\n",
       " {u'c.name': u'XFOR 71', u'res': 11},\n",
       " {u'c.name': u'BP3 10', u'res': 10},\n",
       " {u'c.name': u'BP3 13', u'res': 10},\n",
       " {u'c.name': u'BP3 15', u'res': 10},\n",
       " {u'c.name': u'BP3 19', u'res': 10},\n",
       " {u'c.name': u'BP3 2', u'res': 10},\n",
       " {u'c.name': u'C2 59', u'res': 10},\n",
       " {u'c.name': u'DRSTR@ 2', u'res': 10},\n",
       " {u'c.name': u'DSDDGN', u'res': 10},\n",
       " {u'c.name': u'FF 16', u'res': 10},\n",
       " {u'c.name': u'FF 205', u'res': 10},\n",
       " {u'c.name': u'H2 394', u'res': 10},\n",
       " {u'c.name': u'H2 424', u'res': 10},\n",
       " {u'c.name': u'M/SH3 7', u'res': 10},\n",
       " {u'c.name': u'N 57', u'res': 10},\n",
       " {u'c.name': u'T 207', u'res': 10},\n",
       " {u'c.name': u'T2 4', u'res': 10},\n",
       " {u'c.name': u'TS 16', u'res': 10},\n",
       " {u'c.name': u'UX 359', u'res': 10},\n",
       " {u'c.name': u'W2 43', u'res': 10},\n",
       " {u'c.name': u'W2 82', u'res': 10},\n",
       " {u'c.name': u'WCA2 25', u'res': 10},\n",
       " {u'c.name': u'XF 120', u'res': 10},\n",
       " {u'c.name': u'A 77', u'res': 9},\n",
       " {u'c.name': u'AA2 22', u'res': 9},\n",
       " {u'c.name': u'BP3 11', u'res': 9},\n",
       " {u'c.name': u'BP3 3', u'res': 9},\n",
       " {u'c.name': u'BP3 31', u'res': 9},\n",
       " {u'c.name': u'BP3 4', u'res': 9},\n",
       " {u'c.name': u'C2 62', u'res': 9},\n",
       " {u'c.name': u'CA3 1', u'res': 9},\n",
       " {u'c.name': u'DD/SM 1', u'res': 9},\n",
       " {u'c.name': u'DPOOL3 16', u'res': 9},\n",
       " {u'c.name': u'DRSTR2 57', u'res': 9},\n",
       " {u'c.name': u'DRSTR3 88', u'res': 9},\n",
       " {u'c.name': u'E 7', u'res': 9},\n",
       " {u'c.name': u'FF 214', u'res': 9},\n",
       " {u'c.name': u'FF3 22', u'res': 9},\n",
       " {u'c.name': u'FF3 5', u'res': 9},\n",
       " {u'c.name': u'H2 376', u'res': 9},\n",
       " {u'c.name': u'H2 446', u'res': 9},\n",
       " {u'c.name': u'H@ 18/3', u'res': 9},\n",
       " {u'c.name': u'INV 27', u'res': 9},\n",
       " {u'c.name': u'INV 28', u'res': 9},\n",
       " {u'c.name': u'M/SH3 6', u'res': 9},\n",
       " {u'c.name': u'M/SH3 8', u'res': 9},\n",
       " {u'c.name': u'N 28', u'res': 9},\n",
       " {u'c.name': u'N 54', u'res': 9},\n",
       " {u'c.name': u'N 6', u'res': 9},\n",
       " {u'c.name': u'N 9', u'res': 9},\n",
       " {u'c.name': u'NW 70', u'res': 9},\n",
       " {u'c.name': u'Q 5', u'res': 9},\n",
       " {u'c.name': u'ROM 71', u'res': 9},\n",
       " {u'c.name': u'SLEEP 1', u'res': 9},\n",
       " {u'c.name': u'SS3 73', u'res': 9},\n",
       " {u'c.name': u'T 436', u'res': 9},\n",
       " {u'c.name': u'T 490', u'res': 9},\n",
       " {u'c.name': u'W2 149', u'res': 9},\n",
       " {u'c.name': u'W2 42', u'res': 9},\n",
       " {u'c.name': u'W2 45', u'res': 9},\n",
       " {u'c.name': u'W2 46', u'res': 9},\n",
       " {u'c.name': u'X 39', u'res': 9},\n",
       " {u'c.name': u'X 78', u'res': 9},\n",
       " {u'c.name': u'XF 119', u'res': 9},\n",
       " {u'c.name': u'XF 121', u'res': 9},\n",
       " {u'c.name': u'AVF 9', u'res': 8},\n",
       " {u'c.name': u'BP3 1', u'res': 8},\n",
       " {u'c.name': u'DAZZ 19', u'res': 8},\n",
       " {u'c.name': u'DPOOL3 43', u'res': 8},\n",
       " {u'c.name': u'DRSTR2 7', u'res': 8},\n",
       " {u'c.name': u'DRSTR3 50', u'res': 8},\n",
       " {u'c.name': u'E 4', u'res': 8},\n",
       " {u'c.name': u'FF 15', u'res': 8},\n",
       " {u'c.name': u'H2 208', u'res': 8},\n",
       " {u'c.name': u'H2 251', u'res': 8},\n",
       " {u'c.name': u'H2 252', u'res': 8},\n",
       " {u'c.name': u'H2 270', u'res': 8},\n",
       " {u'c.name': u'H2 387', u'res': 8},\n",
       " {u'c.name': u'H@ 17/5', u'res': 8},\n",
       " {u'c.name': u'JIM 120', u'res': 8},\n",
       " {u'c.name': u'M/TU 77', u'res': 8},\n",
       " {u'c.name': u'N 2', u'res': 8},\n",
       " {u'c.name': u'N 3', u'res': 8},\n",
       " {u'c.name': u'N 4', u'res': 8},\n",
       " {u'c.name': u'NO2 15', u'res': 8},\n",
       " {u'c.name': u'NW 58', u'res': 8},\n",
       " {u'c.name': u'W2 159', u'res': 8},\n",
       " {u'c.name': u'W2 37', u'res': 8},\n",
       " {u'c.name': u'W2 38', u'res': 8},\n",
       " {u'c.name': u'W2 41', u'res': 8},\n",
       " {u'c.name': u'W2 83', u'res': 8},\n",
       " {u'c.name': u'W2 84', u'res': 8},\n",
       " {u'c.name': u'XCAL 35', u'res': 8},\n",
       " {u'c.name': u'AUP 3', u'res': 7},\n",
       " {u'c.name': u'BP3 14', u'res': 7},\n",
       " {u'c.name': u'DD 1', u'res': 7},\n",
       " {u'c.name': u'DPOOL3 19', u'res': 7},\n",
       " {u'c.name': u'DRSTR2 56', u'res': 7},\n",
       " {u'c.name': u'DRSTR2 9', u'res': 7},\n",
       " {u'c.name': u'FF 120', u'res': 7},\n",
       " {u'c.name': u'FF 121', u'res': 7},\n",
       " {u'c.name': u'GR3 29', u'res': 7},\n",
       " {u'c.name': u'H2 171', u'res': 7},\n",
       " {u'c.name': u'H2 194', u'res': 7},\n",
       " {u'c.name': u'H2 195', u'res': 7},\n",
       " {u'c.name': u'H2 457', u'res': 7},\n",
       " {u'c.name': u'H2 474', u'res': 7},\n",
       " {u'c.name': u'H3 24', u'res': 7},\n",
       " {u'c.name': u'H@ 15', u'res': 7},\n",
       " {u'c.name': u'H@ 18', u'res': 7},\n",
       " {u'c.name': u'JIM 121', u'res': 7},\n",
       " {u'c.name': u'NOM2 3', u'res': 7},\n",
       " {u'c.name': u'PPTSS 23', u'res': 7},\n",
       " {u'c.name': u'ROM 60', u'res': 7},\n",
       " {u'c.name': u'ROM 61', u'res': 7},\n",
       " {u'c.name': u'ROM 62', u'res': 7},\n",
       " {u'c.name': u'ROM 64', u'res': 7},\n",
       " {u'c.name': u'S-H2 23', u'res': 7},\n",
       " {u'c.name': u'SS3 74', u'res': 7},\n",
       " {u'c.name': u'SS3 75', u'res': 7},\n",
       " {u'c.name': u'ST 136/2', u'res': 7},\n",
       " {u'c.name': u'T 235', u'res': 7},\n",
       " {u'c.name': u'T 236', u'res': 7},\n",
       " {u'c.name': u'TTA 91/2', u'res': 7},\n",
       " {u'c.name': u'W2 39', u'res': 7},\n",
       " {u'c.name': u'XM 32', u'res': 7},\n",
       " {u'c.name': u'AA2 35', u'res': 6},\n",
       " {u'c.name': u'C2 71', u'res': 6},\n",
       " {u'c.name': u'DAZZ 17', u'res': 6},\n",
       " {u'c.name': u'DD:Y 1', u'res': 6},\n",
       " {u'c.name': u'DOOM2 2', u'res': 6},\n",
       " {u'c.name': u'DPOOL3 15', u'res': 6},\n",
       " {u'c.name': u'DRSTR2 10', u'res': 6},\n",
       " {u'c.name': u'DRSTR2 11', u'res': 6},\n",
       " {u'c.name': u'DRSTR2 12', u'res': 6},\n",
       " {u'c.name': u'E 2', u'res': 6},\n",
       " {u'c.name': u'H2 125', u'res': 6},\n",
       " {u'c.name': u'H2 136', u'res': 6},\n",
       " {u'c.name': u'H2 196', u'res': 6},\n",
       " {u'c.name': u'H2 432', u'res': 6},\n",
       " {u'c.name': u'H2 472', u'res': 6},\n",
       " {u'c.name': u'H2 473', u'res': 6},\n",
       " {u'c.name': u'H3 25', u'res': 6},\n",
       " {u'c.name': u'JIM 114', u'res': 6},\n",
       " {u'c.name': u'JIM 115', u'res': 6},\n",
       " {u'c.name': u'JIM 122', u'res': 6},\n",
       " {u'c.name': u'M/CP 69/2', u'res': 6},\n",
       " {u'c.name': u'M/FAN 14/2', u'res': 6},\n",
       " {u'c.name': u'M/SH3 10/2', u'res': 6},\n",
       " {u'c.name': u'N 59', u'res': 6},\n",
       " {u'c.name': u'ROM 72', u'res': 6},\n",
       " {u'c.name': u'SS3 106', u'res': 6},\n",
       " {u'c.name': u'SS3 107', u'res': 6},\n",
       " {u'c.name': u'SS3 108', u'res': 6},\n",
       " {u'c.name': u'SS3 109', u'res': 6},\n",
       " {u'c.name': u'SS@ 7', u'res': 6},\n",
       " {u'c.name': u'ST 141/2', u'res': 6},\n",
       " {u'c.name': u'T2 27', u'res': 6},\n",
       " {u'c.name': u'T@ 8', u'res': 6},\n",
       " {u'c.name': u'UX 187', u'res': 6},\n",
       " {u'c.name': u'W2 160', u'res': 6},\n",
       " {u'c.name': u'W2 161', u'res': 6},\n",
       " {u'c.name': u'W2 40', u'res': 6},\n",
       " {u'c.name': u'DD 359', u'res': 5},\n",
       " {u'c.name': u'DOOM2 1', u'res': 5},\n",
       " {u'c.name': u'DRSTR2 1', u'res': 5},\n",
       " {u'c.name': u'DRSTR2 5', u'res': 5},\n",
       " {u'c.name': u'DRSTR3 89', u'res': 5},\n",
       " {u'c.name': u'H2 159', u'res': 5},\n",
       " {u'c.name': u'H2 287', u'res': 5},\n",
       " {u'c.name': u'H2 289', u'res': 5},\n",
       " {u'c.name': u'H2 347', u'res': 5},\n",
       " {u'c.name': u'H2 348', u'res': 5},\n",
       " {u'c.name': u'H2 384', u'res': 5},\n",
       " {u'c.name': u'H2 444', u'res': 5},\n",
       " {u'c.name': u'H2 459', u'res': 5},\n",
       " {u'c.name': u'HMAG 13/2', u'res': 5},\n",
       " {u'c.name': u'JIM 123', u'res': 5},\n",
       " {u'c.name': u'M/CP 160/4', u'res': 5},\n",
       " {u'c.name': u'M/PRM 5', u'res': 5},\n",
       " {u'c.name': u'M/PRM 8', u'res': 5},\n",
       " {u'c.name': u'N 1', u'res': 5},\n",
       " {u'c.name': u'ROM 63', u'res': 5},\n",
       " {u'c.name': u'S-H2 21', u'res': 5},\n",
       " {u'c.name': u'S-H2 22', u'res': 5},\n",
       " {u'c.name': u'ST 106', u'res': 5},\n",
       " {u'c.name': u'ST 176', u'res': 5},\n",
       " {u'c.name': u'ST 177', u'res': 5},\n",
       " {u'c.name': u'T 178', u'res': 5},\n",
       " {u'c.name': u'T 305', u'res': 5},\n",
       " {u'c.name': u'TTA 90/2', u'res': 5},\n",
       " {u'c.name': u'WI? 9', u'res': 5},\n",
       " {u'c.name': u'A@ 20/4', u'res': 4},\n",
       " {u'c.name': u'CA3 24', u'res': 4},\n",
       " {u'c.name': u'CA3 36', u'res': 4},\n",
       " {u'c.name': u'H2 261', u'res': 4},\n",
       " {u'c.name': u'H2 288', u'res': 4},\n",
       " {u'c.name': u'H2 364', u'res': 4},\n",
       " {u'c.name': u'H2 431', u'res': 4},\n",
       " {u'c.name': u'H@ 20/3', u'res': 4},\n",
       " {u'c.name': u'IM 28', u'res': 4},\n",
       " {u'c.name': u'M/CP 70/2', u'res': 4},\n",
       " {u'c.name': u'M/TIO 10', u'res': 4},\n",
       " {u'c.name': u'NO2 18', u'res': 4},\n",
       " {u'c.name': u'ROM 67', u'res': 4},\n",
       " {u'c.name': u'SLEEP 2', u'res': 4},\n",
       " {u'c.name': u'ST 114', u'res': 4},\n",
       " {u'c.name': u'ST 174', u'res': 4},\n",
       " {u'c.name': u'T 306', u'res': 4},\n",
       " {u'c.name': u'CA:SL2 11', u'res': 3},\n",
       " {u'c.name': u'CM4 3', u'res': 3},\n",
       " {u'c.name': u'H2 290', u'res': 3},\n",
       " {u'c.name': u'H@ 20', u'res': 3},\n",
       " {u'c.name': u'HMAG 11/2', u'res': 3},\n",
       " {u'c.name': u'HMAG 14/2', u'res': 3},\n",
       " {u'c.name': u'M/SH3 11/2', u'res': 3},\n",
       " {u'c.name': u'M/SPT 28', u'res': 3},\n",
       " {u'c.name': u'M/SPT 29', u'res': 3},\n",
       " {u'c.name': u'NO2 17', u'res': 3},\n",
       " {u'c.name': u'SOLOA 12', u'res': 3},\n",
       " {u'c.name': u'ST 119/2', u'res': 3},\n",
       " {u'c.name': u'ST 142/2', u'res': 3},\n",
       " {u'c.name': u'ST 143/2', u'res': 3},\n",
       " {u'c.name': u'UX 220', u'res': 3},\n",
       " {u'c.name': u'W2 119', u'res': 3},\n",
       " {u'c.name': u'W2 121', u'res': 3},\n",
       " {u'c.name': u'W2 86', u'res': 3},\n",
       " {u'c.name': u'H2 137', u'res': 2},\n",
       " {u'c.name': u'HMAG 12/2', u'res': 2},\n",
       " {u'c.name': u'M/VS 1/4', u'res': 2},\n",
       " {u'c.name': u'SS 12', u'res': 2},\n",
       " {u'c.name': u'XCAL 66', u'res': 2},\n",
       " {u'c.name': u'DS@ 2/5', u'res': 1},\n",
       " {u'c.name': u'M/CO 71/2', u'res': 1},\n",
       " {u'c.name': u'M/PRM 35', u'res': 1},\n",
       " {u'c.name': u'M/PRM 36', u'res': 1},\n",
       " {u'c.name': u'M/PRM 37', u'res': 1},\n",
       " {u'c.name': u'N@ 2/4', u'res': 1},\n",
       " {u'c.name': u'NW 42', u'res': 1}]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sorted(newList, key=lambda dic: dic[u'res'], reverse = True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "les six degrés de Kevin Bacon pour tous les personnages par rapport à Spider-Man"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[[{u'name': u'STRYFE', u'sp': 4}],\n",
       " [{u'name': u'STRYKER, WILLIS', u'sp': 4}],\n",
       " [{u'name': u'STUART, BRIG. ALYSAN', u'sp': 4}],\n",
       " [{u'name': u'STUART, DR.', u'sp': 4}],\n",
       " [{u'name': u'STUART, DR. ALISTAIR', u'sp': 2}],\n",
       " [{u'name': u'STUNNER/ANGELINA BRA', u'sp': 2}],\n",
       " [{u'name': u'STUNT-MASTER/GEORGE,', u'sp': 2}],\n",
       " [{u'name': u'STURDY, PROF. KENNET', u'sp': 4}],\n",
       " [{u'name': u'STYGE, REV.', u'sp': 2}],\n",
       " [{u'name': u'STYGIAN STARBENDER', u'sp': 4}],\n",
       " [{u'name': u'STYGLUT/', u'sp': 4}],\n",
       " [{u'name': u'STYRAK', u'sp': 4}],\n",
       " [{u'name': u'STYX/JACOB EICHORN', u'sp': 2}],\n",
       " [{u'name': u'STYX II', u'sp': 4}],\n",
       " [{u'name': u'SU, DR. KO BIN', u'sp': 4}],\n",
       " [{u'name': u'SUAREZ, RAPHAEL', u'sp': 4}],\n",
       " [{u'name': u'SUB-MARINER/NAMOR MA', u'sp': 2}],\n",
       " [{u'name': u'SUB-MARINER | MUTANT', u'sp': 4}],\n",
       " [{u'name': u'SUEE, FAH LO', u'sp': 4}],\n",
       " [{u'name': u'SUGAR MAN', u'sp': 4}],\n",
       " [{u'name': u'SUICIDE/CHRIS DANIEL', u'sp': 4}],\n",
       " [{u'name': u'SUKHAROV, DIMITRI', u'sp': 4}],\n",
       " [{u'name': u'SUKHAROV, VIKTORIA', u'sp': 4}],\n",
       " [{u'name': u'SUMMERS, DEBORAH', u'sp': 4}],\n",
       " [{u'name': u'SUMMERS, MADELYNE MA', u'sp': 2}],\n",
       " [{u'name': u'SUMMERS, NATHAN CHRI', u'sp': 2}],\n",
       " [{u'name': u'SUMMERS, PHILIP', u'sp': 4}],\n",
       " [{u'name': u'SUMMERS, SCOTT III |', u'sp': 4}],\n",
       " [{u'name': u'SUMO', u'sp': 4}],\n",
       " [{u'name': u'SUN, LIN', u'sp': 2}],\n",
       " [{u'name': u'SUN-TAO', u'sp': 4}],\n",
       " [{u'name': u'SUNDANCE', u'sp': 4}],\n",
       " [{u'name': u'SUNDER', u'sp': 2}],\n",
       " [{u'name': u'SUNDOWN/DR. DAVE LOW', u'sp': 2}],\n",
       " [{u'name': u'SUNDRAGON/PAMELA DOU', u'sp': 4}],\n",
       " [{u'name': u'SUNFIRE/SHIRO YOSHID', u'sp': 2}],\n",
       " [{u'name': u'SUNFIRE/SHIRO YASHID', u'sp': 4}],\n",
       " [{u'name': u'SUNSET', u'sp': 2}],\n",
       " [{u'name': u'SUNSET GRACE', u'sp': 4}],\n",
       " [{u'name': u'SUNSHINE/AUTUMN MACR', u'sp': 4}],\n",
       " [{u'name': u'SUNSPOT/ROBERTO DACO', u'sp': 2}],\n",
       " [{u'name': u'SUNSPOT/ROBERTO DACO', u'sp': 4}],\n",
       " [{u'name': u'SUNSPYRE/LEYU YOSHID', u'sp': 4}],\n",
       " [{u'name': u'SUNSTROKE/', u'sp': 4}],\n",
       " [{u'name': u'SUNTURION/ARTHUR DEA', u'sp': 2}],\n",
       " [{u'name': u'SUNTURION II/MIKE ST', u'sp': 4}],\n",
       " [{u'name': u'SUPER SABRE/MARTIN F', u'sp': 4}],\n",
       " [{u'name': u\"SUPER SKRULL/KL'RT\", u'sp': 2}],\n",
       " [{u'name': u'SUPER-ADAPTOID/ALESS', u'sp': 4}],\n",
       " [{u'name': u'SUPER-ANDROID F-4', u'sp': 4}],\n",
       " [{u'name': u'SUPER-NOVA', u'sp': 4}],\n",
       " [{u'name': u'SUPER-PATRIOT', u'sp': 4}],\n",
       " [{u'name': u'SUPERCHARGER/', u'sp': 4}],\n",
       " [{u'name': u'SUPERIA/WENTWORTH, D', u'sp': 4}],\n",
       " [{u'name': u'SUPREME COMMANDER', u'sp': 4}],\n",
       " [{u'name': u'SUPREME INTELLIGENCE', u'sp': 2}],\n",
       " [{u'name': u'SUPREME ONE', u'sp': 4}],\n",
       " [{u'name': u'SUPREMOR', u'sp': 4}],\n",
       " [{u'name': u'SURESHOT', u'sp': 4}],\n",
       " [{u'name': u'SURGE', u'sp': 4}],\n",
       " [{u'name': u'SURGEON GENERAL/ANGE', u'sp': 2}],\n",
       " [{u'name': u'SURTUR', u'sp': 4}],\n",
       " [{u'name': u'SUTTON, JOHN', u'sp': 4}],\n",
       " [{u'name': u'SUVOROV, ADMIRAL GRI', u'sp': 4}],\n",
       " [{u'name': u'SUWAN', u'sp': 4}],\n",
       " [{u'name': u'SUZIE', u'sp': 4}],\n",
       " [{u'name': u'SVAROG', u'sp': 2}],\n",
       " [{u'name': u'SVYATOGOR/SASHA POKR', u'sp': 4}],\n",
       " [{u'name': u'SWANN, DR. EVAN', u'sp': 2}],\n",
       " [{u'name': u'SWARM/FRITZ VON MEYE', u'sp': 2}],\n",
       " [{u'name': u'SWEEPZWEAK', u'sp': 4}],\n",
       " [{u'name': u'SWIFT/', u'sp': 2}],\n",
       " [{u'name': u'SWITCH/DEVON ALOMAR', u'sp': 4}],\n",
       " [{u'name': u'SWITZLER, BEVERLY', u'sp': 2}],\n",
       " [{u'name': u'SWORDSMAN/JACQUES DU', u'sp': 2}],\n",
       " [{u'name': u'SWORDSMAN II/COTATI', u'sp': 4}],\n",
       " [{u'name': u'SWORDSMAN III/PHILIP', u'sp': 2}],\n",
       " [],\n",
       " [{u'name': u'SYBIL', u'sp': 4}],\n",
       " [{u'name': u'SYBYL DORN', u'sp': 4}],\n",
       " [{u'name': u'SYLPH', u'sp': 4}],\n",
       " [{u'name': u'SYNAPSE/', u'sp': 4}],\n",
       " [{u'name': u'SYNARIO/ANGELA BRADF', u'sp': 2}],\n",
       " [{u'name': u'SYNCH/EVERETT THOMAS', u'sp': 2}],\n",
       " [{u'name': u'SYNRAITH', u'sp': 4}],\n",
       " [{u'name': u'SYPHONN', u'sp': 4}],\n",
       " [{u'name': u'SYRRH', u'sp': 4}],\n",
       " [{u'name': u'SZARDOS, MARGALI', u'sp': 2}],\n",
       " [{u'name': u'SZARDOS, STEFAN', u'sp': 4}],\n",
       " [{u'name': u'SZARKUS', u'sp': 4}],\n",
       " [{u'name': u'T', u'sp': 4}],\n",
       " [{u'name': u\"T'CHAKA\", u'sp': 4}],\n",
       " [{u'name': u\"T'KYLL ALABAR\", u'sp': 4}],\n",
       " [{u'name': u'T-RAY/WADE WILSON', u'sp': 4}],\n",
       " [{u'name': u'TABESHAW, HARRY', u'sp': 4}],\n",
       " [{u'name': u'TABOO', u'sp': 4}],\n",
       " [{u'name': u'TABULA RASA', u'sp': 4}],\n",
       " [{u'name': u'TABUR', u'sp': 4}],\n",
       " [{u'name': u'TAE', u'sp': 4}],\n",
       " [{u'name': u'TAGAK', u'sp': 4}],\n",
       " [{u'name': u'TAGAR', u'sp': 4}],\n",
       " [{u'name': u'TAI', u'sp': 4}],\n",
       " [{u'name': u'TAI II', u'sp': 4}],\n",
       " [{u'name': u'TAIFU/TOSHIO SASAKI', u'sp': 4}],\n",
       " [{u'name': u'TAKACHIHO, HIRO', u'sp': 4}],\n",
       " [{u'name': u'TAKACHIHO, MRS.', u'sp': 4}],\n",
       " [{u'name': u'TAKAHAMA, JANE', u'sp': 4}],\n",
       " [{u'name': u'TAKAHAMA, ROBERT', u'sp': 4}],\n",
       " [{u'name': u'TAKAHASHI, REI', u'sp': 4}],\n",
       " [{u'name': u'TAKAR', u'sp': 4}],\n",
       " [{u'name': u'TAKIMOTO, RON', u'sp': 4}],\n",
       " [{u'name': u'TAKU', u'sp': 4}],\n",
       " [{u'name': u'TAL, GENERAL', u'sp': 4}],\n",
       " [{u'name': u'TALBOT, GLENN', u'sp': 4}],\n",
       " [{u'name': u'TALBOT, MAJ. MATT', u'sp': 4}],\n",
       " [{u'name': u'TALISMAN', u'sp': 2}],\n",
       " [{u'name': u'TALISMAN II/ELIZABET', u'sp': 2}],\n",
       " [{u'name': u'TALISMAN III/NAHITA', u'sp': 4}],\n",
       " [{u'name': u'TALO', u'sp': 4}],\n",
       " [{u'name': u'TALOS', u'sp': 4}],\n",
       " [{u'name': u'TANA NILE', u'sp': 4}],\n",
       " [{u'name': u'TANAKA, GEORGE', u'sp': 4}],\n",
       " [{u'name': u'TANAKA, KENJIRO', u'sp': 2}],\n",
       " [{u'name': u'TANAKA, OPAL', u'sp': 4}],\n",
       " [{u'name': u'TANAKA, RITA', u'sp': 4}],\n",
       " [{u'name': u'TANGERINE 2013', u'sp': 4}],\n",
       " [{u'name': u'TANNEN, PAUL', u'sp': 4}],\n",
       " [{u'name': u'TANNEN, VINCENT', u'sp': 4}],\n",
       " [{u'name': u'TANNER, ARCHIE', u'sp': 4}],\n",
       " [{u'name': u'TANNER, JACKO', u'sp': 4}],\n",
       " [{u'name': u'TANTE MATTIE', u'sp': 4}],\n",
       " [{u'name': u'TANTRUM/', u'sp': 4}],\n",
       " [{u'name': u'TAR', u'sp': 4}],\n",
       " [{u'name': u'TARAKIS', u'sp': 4}],\n",
       " [{u'name': u'TARANTULA/ANTON MIGU', u'sp': 2}],\n",
       " [{u'name': u'TARANTULA II/CAPT. L', u'sp': 2}],\n",
       " [{u'name': u'TARBABY', u'sp': 4}],\n",
       " [{u'name': u'TAREE', u'sp': 4}],\n",
       " [{u'name': u'TAREVA', u'sp': 4}],\n",
       " [{u'name': u'TARGET', u'sp': 4}],\n",
       " [{u'name': u'TARGON', u'sp': 4}],\n",
       " [{u'name': u'TARNOK-KOL', u'sp': 4}],\n",
       " [{u'name': u'TAROOK', u'sp': 4}],\n",
       " [{u'name': u'TAROT/MARIE-ANGE COL', u'sp': 4}],\n",
       " [{u'name': u'TARR, BLACK JACK', u'sp': 2}],\n",
       " [{u'name': u'TARTARUS', u'sp': 4}],\n",
       " [{u'name': u'TASHA', u'sp': 4}],\n",
       " [{u'name': u'TASKMASTER', u'sp': 2}],\n",
       " [{u'name': u\"TATSU'O\", u'sp': 4}],\n",
       " [{u'name': u'TATTERDEMALION/', u'sp': 2}],\n",
       " [{u'name': u'TAUREY, SIR WILLIAM', u'sp': 4}],\n",
       " [{u'name': u'TAUREY, WILLIAM MALC', u'sp': 4}],\n",
       " [{u'name': u'TAURUS/CORNELIUS VAN', u'sp': 4}],\n",
       " [{u'name': u'TAURUS II/', u'sp': 4}],\n",
       " [{u'name': u'TAYLOR, JACK', u'sp': 4}],\n",
       " [{u'name': u'TAYLOR, JENNA', u'sp': 2}],\n",
       " [{u'name': u'TAYLOR, LEILA', u'sp': 2}],\n",
       " [{u'name': u'TECH-NOIR/', u'sp': 4}],\n",
       " [{u'name': u'TECHNARX', u'sp': 4}],\n",
       " [{u'name': u'TECHNOCRAT/RANDY', u'sp': 4}],\n",
       " [{u'name': u'TECHNOSPIKE', u'sp': 4}],\n",
       " [{u'name': u'TEFRAL', u'sp': 2}],\n",
       " [{u'name': u'TEI', u'sp': 4}],\n",
       " [{u'name': u'TELLIS', u'sp': 4}],\n",
       " [{u'name': u'TEMPEST/GRANNZ', u'sp': 4}],\n",
       " [{u'name': u'TEMPEST II/NICOLETTE', u'sp': 2}],\n",
       " [{u'name': u'TEMPLAR/IAN FITZWILL', u'sp': 4}],\n",
       " [{u'name': u'TEMPLE, CLAIRE', u'sp': 2}],\n",
       " [{u'name': u'TEMPO', u'sp': 4}],\n",
       " [{u'name': u'TEMPUS', u'sp': 4}],\n",
       " [{u'name': u'TEN FOR', u'sp': 2}],\n",
       " [{u'name': u'TEN-THIRTIFOR', u'sp': 4}],\n",
       " [{u'name': u'TENDRIL/RIVER VERYS', u'sp': 2}],\n",
       " [{u'name': u'TENEBRAE', u'sp': 4}],\n",
       " [{u'name': u'TENELLE', u'sp': 4}],\n",
       " [{u'name': u'TENG, NIKKI', u'sp': 4}],\n",
       " [{u'name': u'TENKO, CARTER', u'sp': 4}],\n",
       " [{u'name': u'TENNYSON, JACOB', u'sp': 2}],\n",
       " [{u'name': u'TENPIN/ALVIN HEALEY', u'sp': 4}],\n",
       " [{u'name': u'TEQUILA/', u'sp': 4}],\n",
       " [{u'name': u'TERMINATOR', u'sp': 4}],\n",
       " [{u'name': u'TERMINATOR II/PRINCE', u'sp': 4}],\n",
       " [{u'name': u'TERMINUS', u'sp': 2}],\n",
       " [{u'name': u'TERRAFORMER/SAM', u'sp': 4}],\n",
       " [{u'name': u'TERRAX', u'sp': 4}],\n",
       " [{u'name': u'TERRAX II/TYROS', u'sp': 2}],\n",
       " [{u'name': u'TERRAXIA', u'sp': 2}],\n",
       " [{u'name': u'TERREL, DEBORAH', u'sp': 4}],\n",
       " [{u'name': u'TERRIGENE', u'sp': 4}],\n",
       " [{u'name': u'TERROR/LASLO PEVELY', u'sp': 4}],\n",
       " [{u'name': u'TERROR II', u'sp': 2}],\n",
       " [{u'name': u'TESS-ONE', u'sp': 2}],\n",
       " [{u'name': u'TESSA', u'sp': 2}],\n",
       " [{u'name': u'TETHERBLOOD/', u'sp': 4}],\n",
       " [{u'name': u'TETHRA', u'sp': 4}],\n",
       " [{u'name': u'TEUTONIC KNIGHT/FRAN', u'sp': 4}],\n",
       " [{u'name': u'TEXAS TWISTER/DREW D', u'sp': 2}],\n",
       " [{u'name': u'TEZCATLIPOCA', u'sp': 2}],\n",
       " [{u'name': u'THAIS', u'sp': 4}],\n",
       " [{u'name': u'THAKOS', u'sp': 2}],\n",
       " [{u'name': u'THALLIUM', u'sp': 4}],\n",
       " [{u'name': u'THAMES, SERIPHA', u'sp': 4}],\n",
       " [{u'name': u'THAN, VELENA', u'sp': 4}],\n",
       " [{u'name': u'THANADEMOS', u'sp': 4}],\n",
       " [{u'name': u'THANE ECTOR', u'sp': 4}],\n",
       " [{u'name': u'THANOS', u'sp': 2}],\n",
       " [{u'name': u'THANOS DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'THENA', u'sp': 4}],\n",
       " [{u'name': u'THERA', u'sp': 4}],\n",
       " [{u'name': u'THERAK', u'sp': 2}],\n",
       " [{u'name': u'THERMAL MAN', u'sp': 4}],\n",
       " [{u'name': u'THERMITE/', u'sp': 4}],\n",
       " [{u'name': u'THERMO/DR. WALTER MI', u'sp': 2}],\n",
       " [{u'name': u'THERMO II/', u'sp': 4}],\n",
       " [{u'name': u'THERNON', u'sp': 4}],\n",
       " [{u'name': u'THIN MAN/BRUCE DICKS', u'sp': 4}],\n",
       " [{u'name': u'THING/BENJAMIN J. GR', u'sp': 2}],\n",
       " [{u'name': u'THING DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'THING DOPPELGANGER I', u'sp': 4}],\n",
       " [{u'name': u'THING DOPPELGANGER I', u'sp': 4}],\n",
       " [{u'name': u'THING DOPPELGANGER I', u'sp': 4}],\n",
       " [{u'name': u'THINGEE', u'sp': 4}],\n",
       " [{u'name': u'THINKER', u'sp': 2}],\n",
       " [{u'name': u'THOG', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, BECKY', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, COMMANDER DA', u'sp': 2}],\n",
       " [{u'name': u'THOMAS, DR. JOHN', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, DR. STAN', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, IDA', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, JEANIE', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, KIM HO TWAE', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, ROY', u'sp': 4}],\n",
       " [{u'name': u'THOMPSON, EUGENE FLA', u'sp': 2}],\n",
       " [{u'name': u'THOMPSON, HARRISON', u'sp': 2}],\n",
       " [{u'name': u'THOMPSON, JESSICA JE', u'sp': 2}],\n",
       " [{u'name': u'THOMPSON, ROSIE', u'sp': 2}],\n",
       " [{u'name': u'THOR/DR. DONALD BLAK', u'sp': 2}],\n",
       " [{u'name': u'THOR II/ROGER RED NO', u'sp': 2}],\n",
       " [{u'name': u'THOR III DOPPELGANGE', u'sp': 2}],\n",
       " [{u'name': u'THOR III DOPPELGANGE', u'sp': 4}],\n",
       " [{u'name': u'THOR IV/DARGO', u'sp': 4}],\n",
       " [{u'name': u'THOR REPLICOID', u'sp': 4}],\n",
       " [{u'name': u'THOR | EARTH 253', u'sp': 4}],\n",
       " [{u'name': u'THOR | MUTANT X-VERS', u'sp': 4}],\n",
       " [{u'name': u'THORNN', u'sp': 2}],\n",
       " [{u'name': u'THORNN II/LUCIA CALL', u'sp': 4}],\n",
       " [{u'name': u'THORPE, GAVIN', u'sp': 2}],\n",
       " [{u'name': u'THORPE, GORDON', u'sp': 4}],\n",
       " [{u'name': u'THORPE, LUKE', u'sp': 2}],\n",
       " [{u'name': u'THORSON, DR. WALTER', u'sp': 2}],\n",
       " [{u'name': u'THOUSAND', u'sp': 2}],\n",
       " [{u'name': u'THRAXON', u'sp': 4}],\n",
       " [{u'name': u'THREADGOLD', u'sp': 4}],\n",
       " [{u'name': u'THREE-FACE', u'sp': 4}],\n",
       " [{u'name': u'THREETREES', u'sp': 4}],\n",
       " [{u'name': u'THRENODY', u'sp': 2}],\n",
       " [{u'name': u'THUG', u'sp': 2}],\n",
       " [{u'name': u'THULE, GEN.', u'sp': 2}],\n",
       " [{u'name': u'THUMBELLINA', u'sp': 4}],\n",
       " [{u'name': u'THUMPER', u'sp': 4}],\n",
       " [{u'name': u'THUNDERBALL/DR. ELIO', u'sp': 2}],\n",
       " [{u'name': u'THUNDERBIRD/JOHN PRO', u'sp': 4}],\n",
       " [{u'name': u'THUNDERBIRD II/JAMES', u'sp': 2}],\n",
       " [{u'name': u'THUNDERBIRD III/NEAL', u'sp': 2}],\n",
       " [{u'name': u'THUNDERBOLT/BILLY CA', u'sp': 4}],\n",
       " [{u'name': u'THUNDERBOLT II/LUIS', u'sp': 4}],\n",
       " [{u'name': u'THUNDERFIST/', u'sp': 4}],\n",
       " [{u'name': u'THUNDERHEAD/', u'sp': 4}],\n",
       " [{u'name': u'THUNDERSTRIKE/ERIC K', u'sp': 2}],\n",
       " [{u'name': u'THUNDERSWORD', u'sp': 4}],\n",
       " [{u'name': u'THUNDRA', u'sp': 2}],\n",
       " [{u'name': u'THURM, ETHAN', u'sp': 4}],\n",
       " [{u'name': u'TIAMAT', u'sp': 4}],\n",
       " [{u'name': u'TICKTOCK', u'sp': 4}],\n",
       " [{u'name': u'TIERS, MICHELLE', u'sp': 4}],\n",
       " [{u'name': u'TIGER SHARK/TODD ARL', u'sp': 2}],\n",
       " [{u'name': u'TIGRA/GREER NELSON', u'sp': 2}],\n",
       " [{u'name': u'TIKUAK', u'sp': 4}],\n",
       " [{u'name': u'TILBY, TRISH/PATRICI', u'sp': 2}],\n",
       " [{u'name': u'TILDA', u'sp': 4}],\n",
       " [{u'name': u'TILLIE THE HUN/MATIL', u'sp': 4}],\n",
       " [{u'name': u'TILTON, ROLAND R.', u'sp': 4}],\n",
       " [{u'name': u'TIMBERIUS', u'sp': 4}],\n",
       " [{u'name': u'TIMBERIUS II', u'sp': 4}],\n",
       " [{u'name': u'TIMEBOMB/LOUIS JOUBE', u'sp': 4}],\n",
       " [{u'name': u'TIMESHADOW', u'sp': 4}],\n",
       " [{u'name': u'TIMESLIP/RINA PATEL', u'sp': 4}],\n",
       " [{u'name': u'TIMESLOT', u'sp': 4}],\n",
       " [{u'name': u'TIMMONS', u'sp': 4}],\n",
       " [{u'name': u'TINAC', u'sp': 4}],\n",
       " [{u'name': u'TINKER, SHEA', u'sp': 2}],\n",
       " [{u'name': u'TINKERER', u'sp': 2}],\n",
       " [{u'name': u'TITAN', u'sp': 4}],\n",
       " [{u'name': u'TITAN, TRISH', u'sp': 4}],\n",
       " [{u'name': u'TITANIA/', u'sp': 2}],\n",
       " [{u'name': u'TITANIA II/MARY SKEE', u'sp': 2}],\n",
       " [{u'name': u'TITANIUM MAN/BORIS B', u'sp': 4}],\n",
       " [{u'name': u'TITANIUM MAN III/BOR', u'sp': 4}],\n",
       " [{u'name': u'TITHE COLLECTOR', u'sp': 4}],\n",
       " [{u'name': u'TIWAZ', u'sp': 4}],\n",
       " [{u'name': u'TOAD/MORTIMER TOYNBE', u'sp': 2}],\n",
       " [{u'name': u'TOBIAS', u'sp': 4}],\n",
       " [{u'name': u'TODD, FISHER', u'sp': 4}],\n",
       " [{u'name': u'TOFIELD, FRANCESCA', u'sp': 4}],\n",
       " [{u'name': u'TOI/REXEL TOIVEN', u'sp': 4}],\n",
       " [{u'name': u'TOKEN', u'sp': 4}],\n",
       " [{u'name': u'TOKKOTS', u'sp': 2}],\n",
       " [{u'name': u'TOL-NOK', u'sp': 4}],\n",
       " [{u'name': u'TOLOC', u'sp': 4}],\n",
       " [{u'name': u'TOLLIVER', u'sp': 4}],\n",
       " [{u'name': u'TOLLIVER, EMMA', u'sp': 4}],\n",
       " [{u'name': u'TOLLIVER, MELBA', u'sp': 2}],\n",
       " [{u'name': u'TOLLIVER, REV. JACKS', u'sp': 2}],\n",
       " [{u'name': u'TOLLIVER, SHERIFF JO', u'sp': 4}],\n",
       " [{u'name': u'TOM THUMB/THOMAS THO', u'sp': 2}],\n",
       " [{u'name': u'TOMAZOOMA', u'sp': 4}],\n",
       " [{u'name': u'TOMAZOOMA II', u'sp': 4}],\n",
       " [{u'name': u'TOMBSTONE/LONNIE THO', u'sp': 2}],\n",
       " [{u'name': u'TOMMY LIGHTNING/', u'sp': 4}],\n",
       " [{u'name': u'TOMORROW HAWK/CEYOTE', u'sp': 4}],\n",
       " [{u'name': u'TONGAH', u'sp': 2}],\n",
       " [{u'name': u'TOOTHGRINDER', u'sp': 4}],\n",
       " [{u'name': u'TOOTHGNASHER', u'sp': 4}],\n",
       " [{u'name': u'TOPAZ', u'sp': 2}],\n",
       " [{u'name': u'TOPSPIN/DARREN MITCH', u'sp': 4}],\n",
       " [{u'name': u'TORES', u'sp': 4}],\n",
       " [{u'name': u'TORG', u'sp': 4}],\n",
       " [{u'name': u'TORGO', u'sp': 4}],\n",
       " [{u'name': u'TORK, LT.', u'sp': 2}],\n",
       " [{u'name': u'TORK, SGT.', u'sp': 2}],\n",
       " [{u'name': u'TORO/TOM RAYMOND', u'sp': 2}],\n",
       " [{u'name': u'TORO II/BENITO SERRA', u'sp': 4}],\n",
       " [{u'name': u'TORPEDO', u'sp': 4}],\n",
       " [{u'name': u'TORPEDO II/MICHAEL S', u'sp': 4}],\n",
       " [{u'name': u'TORPEDO III/BROCK JO', u'sp': 2}],\n",
       " [{u'name': u'TORQUE II', u'sp': 4}],\n",
       " [{u'name': u'TOSHI', u'sp': 4}],\n",
       " [{u'name': u'TOTEM', u'sp': 4}],\n",
       " [{u'name': u'TOUGH LOVE/', u'sp': 4}],\n",
       " [{u'name': u'TOWER', u'sp': 4}],\n",
       " [{u'name': u'TOWER, BLAKE', u'sp': 2}],\n",
       " [{u'name': u'TOWNSEND, CHRIS', u'sp': 2}],\n",
       " [{u'name': u'TOY', u'sp': 2}],\n",
       " [{u'name': u'TRACER', u'sp': 2}],\n",
       " [{u'name': u'TRACKER', u'sp': 4}],\n",
       " [{u'name': u'TRADER', u'sp': 4}],\n",
       " [{u'name': u'TRAINER, DR. SEWARD', u'sp': 2}],\n",
       " [{u'name': u'TRANTRA', u'sp': 4}],\n",
       " [{u'name': u'TRAPPER/VOLA', u'sp': 4}],\n",
       " [{u'name': u'TRAPSTER/PETER PETRU', u'sp': 2}],\n",
       " [{u'name': u'TRAPSTER II/LARRY CU', u'sp': 4}],\n",
       " [{u'name': u'TRASK', u'sp': 4}],\n",
       " [{u'name': u'TRASK, DR. BOLIVAR', u'sp': 4}],\n",
       " [{u'name': u'TRASK, DR. DONALD TR', u'sp': 4}],\n",
       " [{u'name': u'TRASK, LAWRENCE LARR', u'sp': 4}],\n",
       " [{u'name': u'TRASK, RAYMOND', u'sp': 2}],\n",
       " [{u'name': u'TRAUMA', u'sp': 4}],\n",
       " [{u'name': u'TRAVELER', u'sp': 4}],\n",
       " [{u'name': u'TRAVELLER, DR. JUDAS', u'sp': 2}],\n",
       " [{u'name': u'TRAVERS, MIKE', u'sp': 4}],\n",
       " [{u'name': u'TRAYNOR, HARLEY', u'sp': 4}],\n",
       " [{u'name': u'TREMELO/', u'sp': 4}],\n",
       " [{u'name': u'TREMONT, JONATHAN', u'sp': 4}],\n",
       " [{u'name': u'TREVANE, DET. CONNOR', u'sp': 2}],\n",
       " [{u'name': u'TREVANI, DANIKA', u'sp': 4}],\n",
       " [{u'name': u'TREVOR, STEVE', u'sp': 4}],\n",
       " [{u'name': u'TREVORIK', u'sp': 4}],\n",
       " [{u'name': u'TRI-SENTINEL', u'sp': 2}],\n",
       " [{u'name': u'TRIATHLON/DELROY GAR', u'sp': 2}],\n",
       " [{u'name': u'TRIAX', u'sp': 4}],\n",
       " [{u'name': u'TRICKSHOT', u'sp': 4}],\n",
       " [{u'name': u'TRICKSTER', u'sp': 4}],\n",
       " [{u'name': u'TRIMPE, HERB', u'sp': 4}],\n",
       " [{u'name': u'TRION', u'sp': 4}],\n",
       " [{u'name': u'TRITON', u'sp': 2}],\n",
       " [{u'name': u'TRITON DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'TRITON DOPPELGANGER,', u'sp': 4}],\n",
       " [{u'name': u'TRITON | MUTANT X-VE', u'sp': 4}],\n",
       " [{u'name': u'TROLL/', u'sp': 2}],\n",
       " [{u'name': u'TRUMP/', u'sp': 4}],\n",
       " [{u'name': u'TRUTH', u'sp': 2}],\n",
       " [{u'name': u'TRUTH II', u'sp': 4}],\n",
       " [{u'name': u'TRYKUR', u'sp': 4}],\n",
       " [{u'name': u'TSERRON', u'sp': 4}],\n",
       " [{u'name': u'TSKAROV, GENERAL', u'sp': 4}],\n",
       " [{u'name': u'TSO, JASON', u'sp': 4}],\n",
       " [{u'name': u'TSUNG, MARCUS', u'sp': 4}],\n",
       " [{u'name': u'TSURAYABA, MATSUO', u'sp': 4}],\n",
       " [{u'name': u'TU', u'sp': 4}],\n",
       " [{u'name': u'TUATARA/COMMANDER AR', u'sp': 4}],\n",
       " [{u'name': u'TUC', u'sp': 4}],\n",
       " [{u'name': u'TULAK', u'sp': 4}],\n",
       " [{u'name': u'TULL', u'sp': 4}],\n",
       " [{u'name': u'TULLY, DEREK', u'sp': 4}],\n",
       " [{u'name': u'TUMBLER/JOHN ROBERT,', u'sp': 4}],\n",
       " [{u'name': u'TUMOLO, DR. JOANNE', u'sp': 4}],\n",
       " [{u'name': u'TUNDRA', u'sp': 4}],\n",
       " [{u'name': u'TUNGSTEN', u'sp': 4}],\n",
       " [{u'name': u'TUPA', u'sp': 4}],\n",
       " [{u'name': u'TURBO II (A)/MICHIKO', u'sp': 2}],\n",
       " [{u'name': u'TURBO II (B)/MIKE JE', u'sp': 4}],\n",
       " [{u'name': u'TURK', u'sp': 2}],\n",
       " [{u'name': u'TURK II', u'sp': 4}],\n",
       " [{u'name': u'TURMOIL', u'sp': 4}],\n",
       " [{u'name': u'TUSK', u'sp': 4}],\n",
       " [{u'name': u'TUTINAX', u'sp': 4}],\n",
       " [{u'name': u'TUVO', u'sp': 4}],\n",
       " [{u'name': u'TWAKI, DR. TED', u'sp': 2}],\n",
       " [{u'name': u'TWEEDLEDOPE', u'sp': 4}],\n",
       " [{u'name': u'TWIT', u'sp': 2}],\n",
       " [{u'name': u'TWO-GUN KID', u'sp': 2}],\n",
       " [{u'name': u'TYCHO', u'sp': 2}],\n",
       " [{u'name': u'TYGER TIGER/JESSAN H', u'sp': 4}],\n",
       " [{u'name': u'TYGER, LORD', u'sp': 4}],\n",
       " [{u'name': u'TYGERSTRYKE/', u'sp': 4}],\n",
       " [{u'name': u'TYN-DARMUTH', u'sp': 4}],\n",
       " [{u'name': u'TYNDAR', u'sp': 4}],\n",
       " [{u'name': u'TYNE, ELIZABETH/JANI', u'sp': 4}],\n",
       " [{u'name': u'TYPEFACE/GORDON THOM', u'sp': 2}],\n",
       " [{u'name': u'TYPHOID MARY/MARY ME', u'sp': 2}],\n",
       " [{u'name': u'TYPHOID MARY | MUTAN', u'sp': 4}],\n",
       " [{u'name': u'TYPHON', u'sp': 4}],\n",
       " [{u'name': u'TYPHOON/', u'sp': 6}],\n",
       " [{u'name': u'TYR', u'sp': 4}],\n",
       " [{u'name': u'TYRAK', u'sp': 4}],\n",
       " [{u'name': u'TYRANNUS', u'sp': 2}],\n",
       " [{u'name': u'TYRANT', u'sp': 4}],\n",
       " [{u'name': u'TYRUS', u'sp': 4}],\n",
       " [{u'name': u'TYRUS KRILL', u'sp': 4}],\n",
       " [{u'name': u'U-GO GIRL/EDIE', u'sp': 4}],\n",
       " [{u'name': u'U-MAN/MERRANO', u'sp': 4}],\n",
       " [{u'name': u'UATU', u'sp': 2}],\n",
       " [{u'name': u'UATU | MUTANT X-VERS', u'sp': 4}],\n",
       " [{u'name': u'UGLY JOHN/STEVE', u'sp': 4}],\n",
       " [{u'name': u'ULARA', u'sp': 4}],\n",
       " [{u'name': u'ULIK', u'sp': 2}],\n",
       " [{u'name': u'ULTARNT', u'sp': 4}],\n",
       " [{u'name': u'ULTIMA', u'sp': 4}],\n",
       " [{u'name': u'ULTIMATOR/', u'sp': 4}],\n",
       " [{u'name': u'ULTIMO', u'sp': 4}],\n",
       " [{u'name': u'ULTIMUS', u'sp': 4}],\n",
       " [{u'name': u'ULTRA-MAX', u'sp': 4}],\n",
       " [{u'name': u'ULTRON', u'sp': 2}],\n",
       " [{u'name': u'ULTRON 2010', u'sp': 4}],\n",
       " [{u'name': u'ULYSSES', u'sp': 6}],\n",
       " [{u'name': u'ULYSSES II', u'sp': 2}],\n",
       " [{u'name': u'UMAR', u'sp': 4}],\n",
       " [{u'name': u'UNA', u'sp': 4}],\n",
       " [{u'name': u'UNBEING/BILLY BETELH', u'sp': 4}],\n",
       " [{u'name': u'UNCEGILA', u'sp': 4}],\n",
       " [{u'name': u'UNCLE PYKO', u'sp': 4}],\n",
       " [{u'name': u'UNCLE SAM', u'sp': 4}],\n",
       " [{u'name': u'UNDERTAKER/CONRAD EI', u'sp': 2}],\n",
       " [{u'name': u'UNDERTOW', u'sp': 4}],\n",
       " [{u'name': u'UNI-LORD', u'sp': 4}],\n",
       " [{u'name': u'UNICORN/MYLOS MASARY', u'sp': 2}],\n",
       " [{u'name': u'UNICORN II/', u'sp': 4}],\n",
       " [{u'name': u'UNICORN III/', u'sp': 4}],\n",
       " [{u'name': u'UNION JACK/LORD MONT', u'sp': 4}],\n",
       " [{u'name': u'UNION JACK II/BRIAN,', u'sp': 4}],\n",
       " [{u'name': u'UNION JACK III/JOEY,', u'sp': 2}],\n",
       " [{u'name': u'UNIT', u'sp': 6}],\n",
       " [{u'name': u'UNIT 101101', u'sp': 4}],\n",
       " [{u'name': u'UNSEEN/UNAM', u'sp': 4}],\n",
       " [{u'name': u'UNUS THE UNTOUCHABLE', u'sp': 2}],\n",
       " [{u'name': u'UNUSCIONE', u'sp': 4}],\n",
       " [{u'name': u'UPLINK/HECTOR FUENTE', u'sp': 4}],\n",
       " [{u'name': u'UR-LINI', u'sp': 4}],\n",
       " [{u'name': u'URANIUM', u'sp': 2}],\n",
       " [{u'name': u'URCHALLA', u'sp': 4}],\n",
       " [{u'name': u'URICH, BEN', u'sp': 2}],\n",
       " [{u'name': u'URICH, DORIS', u'sp': 2}],\n",
       " [{u'name': u'UROC', u'sp': 2}],\n",
       " [{u'name': u'URSA MAJOR/MIKHAIL U', u'sp': 2}],\n",
       " [{u'name': u'URSON-WELLZ', u'sp': 4}],\n",
       " [{u'name': u'URSULA', u'sp': 4}],\n",
       " [{u'name': u'URSULA, LADY', u'sp': 4}],\n",
       " [{u'name': u'URTHONA', u'sp': 4}],\n",
       " [{u'name': u'USAGENT/CAPTAIN JOHN', u'sp': 2}],\n",
       " [{u'name': u'USAGENT DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'UTGARD-LOKI', u'sp': 4}],\n",
       " [{u'name': u'VACUUM', u'sp': 2}],\n",
       " [{u'name': u'VAGABOND/PRISCILLA L', u'sp': 4}],\n",
       " [{u'name': u'VAGUE/', u'sp': 4}],\n",
       " [{u'name': u'VAKUME', u'sp': 2}],\n",
       " [{u'name': u'VALERIA', u'sp': 4}],\n",
       " [{u'name': u'VALINOR', u'sp': 2}],\n",
       " [{u'name': u'VALKIN', u'sp': 4}],\n",
       " [{u'name': u'VALKYRIE II | MUTANT', u'sp': 4}],\n",
       " [{u'name': u'VALKYRIE IV', u'sp': 4}],\n",
       " [{u'name': u'VALTORR', u'sp': 4}],\n",
       " [{u'name': u'VAMP', u'sp': 4}],\n",
       " [{u'name': u'VAN HELSING, RACHEL', u'sp': 4}],\n",
       " [{u'name': u'VAN NUYS, PROF. RODE', u'sp': 4}],\n",
       " [{u'name': u'VANADIUM', u'sp': 4}],\n",
       " [{u'name': u'VANCE REBUS/', u'sp': 4}],\n",
       " [{u'name': u'VANDERGILL, GEORGE', u'sp': 2}],\n",
       " [{u'name': u'VANE, ROGER', u'sp': 4}],\n",
       " [{u'name': u'VANESSA', u'sp': 4}],\n",
       " [{u'name': u'VANGUARD/NICOLAI KRY', u'sp': 2}]]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "maList=[]\n",
    "\n",
    "\n",
    "for index in range(5500,6000):\n",
    "    maList.append(\n",
    "    graph.run('''\n",
    "    MATCH p =shortestPath((n1: character{name: \"SPIDER-MAN/PETER PAR\"})-[r *..6]-(n2: character{number: {I}}))\n",
    "    WITH length(p) as sp, n2.name as name\n",
    "    RETURN sp, name ''',{\"I\":str(index)}).data())\n",
    "maList\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def relations(nomduPerso):\n",
    "    maList=[]\n",
    "    for index in range(5500,6000):\n",
    "        maList.append(\n",
    "        graph.run('''\n",
    "        MATCH p =shortestPath((n1: character{name: {N}})-[r *..6]-(n2: character{number: {I}}))\n",
    "        WITH length(p) as sp, n2.name as name\n",
    "        RETURN sp, name ''',{\"I\":str(index), \"N\":nomduPerso}).data())\n",
    "    return maList\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[[{u'name': u'STRYFE', u'sp': 4}],\n",
       " [{u'name': u'STRYKER, WILLIS', u'sp': 4}],\n",
       " [{u'name': u'STUART, BRIG. ALYSAN', u'sp': 4}],\n",
       " [{u'name': u'STUART, DR.', u'sp': 4}],\n",
       " [{u'name': u'STUART, DR. ALISTAIR', u'sp': 2}],\n",
       " [{u'name': u'STUNNER/ANGELINA BRA', u'sp': 2}],\n",
       " [{u'name': u'STUNT-MASTER/GEORGE,', u'sp': 2}],\n",
       " [{u'name': u'STURDY, PROF. KENNET', u'sp': 4}],\n",
       " [{u'name': u'STYGE, REV.', u'sp': 2}],\n",
       " [{u'name': u'STYGIAN STARBENDER', u'sp': 4}],\n",
       " [{u'name': u'STYGLUT/', u'sp': 4}],\n",
       " [{u'name': u'STYRAK', u'sp': 4}],\n",
       " [{u'name': u'STYX/JACOB EICHORN', u'sp': 2}],\n",
       " [{u'name': u'STYX II', u'sp': 4}],\n",
       " [{u'name': u'SU, DR. KO BIN', u'sp': 4}],\n",
       " [{u'name': u'SUAREZ, RAPHAEL', u'sp': 4}],\n",
       " [{u'name': u'SUB-MARINER/NAMOR MA', u'sp': 2}],\n",
       " [{u'name': u'SUB-MARINER | MUTANT', u'sp': 4}],\n",
       " [{u'name': u'SUEE, FAH LO', u'sp': 4}],\n",
       " [{u'name': u'SUGAR MAN', u'sp': 4}],\n",
       " [{u'name': u'SUICIDE/CHRIS DANIEL', u'sp': 4}],\n",
       " [{u'name': u'SUKHAROV, DIMITRI', u'sp': 4}],\n",
       " [{u'name': u'SUKHAROV, VIKTORIA', u'sp': 4}],\n",
       " [{u'name': u'SUMMERS, DEBORAH', u'sp': 4}],\n",
       " [{u'name': u'SUMMERS, MADELYNE MA', u'sp': 2}],\n",
       " [{u'name': u'SUMMERS, NATHAN CHRI', u'sp': 2}],\n",
       " [{u'name': u'SUMMERS, PHILIP', u'sp': 4}],\n",
       " [{u'name': u'SUMMERS, SCOTT III |', u'sp': 4}],\n",
       " [{u'name': u'SUMO', u'sp': 4}],\n",
       " [{u'name': u'SUN, LIN', u'sp': 2}],\n",
       " [{u'name': u'SUN-TAO', u'sp': 4}],\n",
       " [{u'name': u'SUNDANCE', u'sp': 4}],\n",
       " [{u'name': u'SUNDER', u'sp': 2}],\n",
       " [{u'name': u'SUNDOWN/DR. DAVE LOW', u'sp': 2}],\n",
       " [{u'name': u'SUNDRAGON/PAMELA DOU', u'sp': 4}],\n",
       " [{u'name': u'SUNFIRE/SHIRO YOSHID', u'sp': 2}],\n",
       " [{u'name': u'SUNFIRE/SHIRO YASHID', u'sp': 4}],\n",
       " [{u'name': u'SUNSET', u'sp': 2}],\n",
       " [{u'name': u'SUNSET GRACE', u'sp': 4}],\n",
       " [{u'name': u'SUNSHINE/AUTUMN MACR', u'sp': 4}],\n",
       " [{u'name': u'SUNSPOT/ROBERTO DACO', u'sp': 2}],\n",
       " [{u'name': u'SUNSPOT/ROBERTO DACO', u'sp': 4}],\n",
       " [{u'name': u'SUNSPYRE/LEYU YOSHID', u'sp': 4}],\n",
       " [{u'name': u'SUNSTROKE/', u'sp': 4}],\n",
       " [{u'name': u'SUNTURION/ARTHUR DEA', u'sp': 2}],\n",
       " [{u'name': u'SUNTURION II/MIKE ST', u'sp': 4}],\n",
       " [{u'name': u'SUPER SABRE/MARTIN F', u'sp': 4}],\n",
       " [{u'name': u\"SUPER SKRULL/KL'RT\", u'sp': 2}],\n",
       " [{u'name': u'SUPER-ADAPTOID/ALESS', u'sp': 4}],\n",
       " [{u'name': u'SUPER-ANDROID F-4', u'sp': 4}],\n",
       " [{u'name': u'SUPER-NOVA', u'sp': 4}],\n",
       " [{u'name': u'SUPER-PATRIOT', u'sp': 4}],\n",
       " [{u'name': u'SUPERCHARGER/', u'sp': 4}],\n",
       " [{u'name': u'SUPERIA/WENTWORTH, D', u'sp': 4}],\n",
       " [{u'name': u'SUPREME COMMANDER', u'sp': 4}],\n",
       " [{u'name': u'SUPREME INTELLIGENCE', u'sp': 2}],\n",
       " [{u'name': u'SUPREME ONE', u'sp': 4}],\n",
       " [{u'name': u'SUPREMOR', u'sp': 4}],\n",
       " [{u'name': u'SURESHOT', u'sp': 4}],\n",
       " [{u'name': u'SURGE', u'sp': 4}],\n",
       " [{u'name': u'SURGEON GENERAL/ANGE', u'sp': 2}],\n",
       " [{u'name': u'SURTUR', u'sp': 4}],\n",
       " [{u'name': u'SUTTON, JOHN', u'sp': 4}],\n",
       " [{u'name': u'SUVOROV, ADMIRAL GRI', u'sp': 4}],\n",
       " [{u'name': u'SUWAN', u'sp': 4}],\n",
       " [{u'name': u'SUZIE', u'sp': 4}],\n",
       " [{u'name': u'SVAROG', u'sp': 2}],\n",
       " [{u'name': u'SVYATOGOR/SASHA POKR', u'sp': 4}],\n",
       " [{u'name': u'SWANN, DR. EVAN', u'sp': 2}],\n",
       " [{u'name': u'SWARM/FRITZ VON MEYE', u'sp': 2}],\n",
       " [{u'name': u'SWEEPZWEAK', u'sp': 4}],\n",
       " [{u'name': u'SWIFT/', u'sp': 2}],\n",
       " [{u'name': u'SWITCH/DEVON ALOMAR', u'sp': 4}],\n",
       " [{u'name': u'SWITZLER, BEVERLY', u'sp': 2}],\n",
       " [{u'name': u'SWORDSMAN/JACQUES DU', u'sp': 2}],\n",
       " [{u'name': u'SWORDSMAN II/COTATI', u'sp': 4}],\n",
       " [{u'name': u'SWORDSMAN III/PHILIP', u'sp': 2}],\n",
       " [],\n",
       " [{u'name': u'SYBIL', u'sp': 4}],\n",
       " [{u'name': u'SYBYL DORN', u'sp': 4}],\n",
       " [{u'name': u'SYLPH', u'sp': 4}],\n",
       " [{u'name': u'SYNAPSE/', u'sp': 4}],\n",
       " [{u'name': u'SYNARIO/ANGELA BRADF', u'sp': 2}],\n",
       " [{u'name': u'SYNCH/EVERETT THOMAS', u'sp': 2}],\n",
       " [{u'name': u'SYNRAITH', u'sp': 4}],\n",
       " [{u'name': u'SYPHONN', u'sp': 4}],\n",
       " [{u'name': u'SYRRH', u'sp': 4}],\n",
       " [{u'name': u'SZARDOS, MARGALI', u'sp': 2}],\n",
       " [{u'name': u'SZARDOS, STEFAN', u'sp': 4}],\n",
       " [{u'name': u'SZARKUS', u'sp': 4}],\n",
       " [{u'name': u'T', u'sp': 4}],\n",
       " [{u'name': u\"T'CHAKA\", u'sp': 4}],\n",
       " [{u'name': u\"T'KYLL ALABAR\", u'sp': 4}],\n",
       " [{u'name': u'T-RAY/WADE WILSON', u'sp': 4}],\n",
       " [{u'name': u'TABESHAW, HARRY', u'sp': 4}],\n",
       " [{u'name': u'TABOO', u'sp': 4}],\n",
       " [{u'name': u'TABULA RASA', u'sp': 4}],\n",
       " [{u'name': u'TABUR', u'sp': 4}],\n",
       " [{u'name': u'TAE', u'sp': 4}],\n",
       " [{u'name': u'TAGAK', u'sp': 4}],\n",
       " [{u'name': u'TAGAR', u'sp': 4}],\n",
       " [{u'name': u'TAI', u'sp': 4}],\n",
       " [{u'name': u'TAI II', u'sp': 4}],\n",
       " [{u'name': u'TAIFU/TOSHIO SASAKI', u'sp': 4}],\n",
       " [{u'name': u'TAKACHIHO, HIRO', u'sp': 4}],\n",
       " [{u'name': u'TAKACHIHO, MRS.', u'sp': 4}],\n",
       " [{u'name': u'TAKAHAMA, JANE', u'sp': 4}],\n",
       " [{u'name': u'TAKAHAMA, ROBERT', u'sp': 4}],\n",
       " [{u'name': u'TAKAHASHI, REI', u'sp': 4}],\n",
       " [{u'name': u'TAKAR', u'sp': 4}],\n",
       " [{u'name': u'TAKIMOTO, RON', u'sp': 4}],\n",
       " [{u'name': u'TAKU', u'sp': 4}],\n",
       " [{u'name': u'TAL, GENERAL', u'sp': 4}],\n",
       " [{u'name': u'TALBOT, GLENN', u'sp': 4}],\n",
       " [{u'name': u'TALBOT, MAJ. MATT', u'sp': 4}],\n",
       " [{u'name': u'TALISMAN', u'sp': 2}],\n",
       " [{u'name': u'TALISMAN II/ELIZABET', u'sp': 2}],\n",
       " [{u'name': u'TALISMAN III/NAHITA', u'sp': 4}],\n",
       " [{u'name': u'TALO', u'sp': 4}],\n",
       " [{u'name': u'TALOS', u'sp': 4}],\n",
       " [{u'name': u'TANA NILE', u'sp': 4}],\n",
       " [{u'name': u'TANAKA, GEORGE', u'sp': 4}],\n",
       " [{u'name': u'TANAKA, KENJIRO', u'sp': 2}],\n",
       " [{u'name': u'TANAKA, OPAL', u'sp': 4}],\n",
       " [{u'name': u'TANAKA, RITA', u'sp': 4}],\n",
       " [{u'name': u'TANGERINE 2013', u'sp': 4}],\n",
       " [{u'name': u'TANNEN, PAUL', u'sp': 4}],\n",
       " [{u'name': u'TANNEN, VINCENT', u'sp': 4}],\n",
       " [{u'name': u'TANNER, ARCHIE', u'sp': 4}],\n",
       " [{u'name': u'TANNER, JACKO', u'sp': 4}],\n",
       " [{u'name': u'TANTE MATTIE', u'sp': 4}],\n",
       " [{u'name': u'TANTRUM/', u'sp': 4}],\n",
       " [{u'name': u'TAR', u'sp': 4}],\n",
       " [{u'name': u'TARAKIS', u'sp': 4}],\n",
       " [{u'name': u'TARANTULA/ANTON MIGU', u'sp': 2}],\n",
       " [{u'name': u'TARANTULA II/CAPT. L', u'sp': 2}],\n",
       " [{u'name': u'TARBABY', u'sp': 4}],\n",
       " [{u'name': u'TAREE', u'sp': 4}],\n",
       " [{u'name': u'TAREVA', u'sp': 4}],\n",
       " [{u'name': u'TARGET', u'sp': 4}],\n",
       " [{u'name': u'TARGON', u'sp': 4}],\n",
       " [{u'name': u'TARNOK-KOL', u'sp': 4}],\n",
       " [{u'name': u'TAROOK', u'sp': 4}],\n",
       " [{u'name': u'TAROT/MARIE-ANGE COL', u'sp': 4}],\n",
       " [{u'name': u'TARR, BLACK JACK', u'sp': 2}],\n",
       " [{u'name': u'TARTARUS', u'sp': 4}],\n",
       " [{u'name': u'TASHA', u'sp': 4}],\n",
       " [{u'name': u'TASKMASTER', u'sp': 2}],\n",
       " [{u'name': u\"TATSU'O\", u'sp': 4}],\n",
       " [{u'name': u'TATTERDEMALION/', u'sp': 2}],\n",
       " [{u'name': u'TAUREY, SIR WILLIAM', u'sp': 4}],\n",
       " [{u'name': u'TAUREY, WILLIAM MALC', u'sp': 4}],\n",
       " [{u'name': u'TAURUS/CORNELIUS VAN', u'sp': 4}],\n",
       " [{u'name': u'TAURUS II/', u'sp': 4}],\n",
       " [{u'name': u'TAYLOR, JACK', u'sp': 4}],\n",
       " [{u'name': u'TAYLOR, JENNA', u'sp': 2}],\n",
       " [{u'name': u'TAYLOR, LEILA', u'sp': 2}],\n",
       " [{u'name': u'TECH-NOIR/', u'sp': 4}],\n",
       " [{u'name': u'TECHNARX', u'sp': 4}],\n",
       " [{u'name': u'TECHNOCRAT/RANDY', u'sp': 4}],\n",
       " [{u'name': u'TECHNOSPIKE', u'sp': 4}],\n",
       " [{u'name': u'TEFRAL', u'sp': 2}],\n",
       " [{u'name': u'TEI', u'sp': 4}],\n",
       " [{u'name': u'TELLIS', u'sp': 4}],\n",
       " [{u'name': u'TEMPEST/GRANNZ', u'sp': 4}],\n",
       " [{u'name': u'TEMPEST II/NICOLETTE', u'sp': 2}],\n",
       " [{u'name': u'TEMPLAR/IAN FITZWILL', u'sp': 4}],\n",
       " [{u'name': u'TEMPLE, CLAIRE', u'sp': 2}],\n",
       " [{u'name': u'TEMPO', u'sp': 4}],\n",
       " [{u'name': u'TEMPUS', u'sp': 4}],\n",
       " [{u'name': u'TEN FOR', u'sp': 2}],\n",
       " [{u'name': u'TEN-THIRTIFOR', u'sp': 4}],\n",
       " [{u'name': u'TENDRIL/RIVER VERYS', u'sp': 2}],\n",
       " [{u'name': u'TENEBRAE', u'sp': 4}],\n",
       " [{u'name': u'TENELLE', u'sp': 4}],\n",
       " [{u'name': u'TENG, NIKKI', u'sp': 4}],\n",
       " [{u'name': u'TENKO, CARTER', u'sp': 4}],\n",
       " [{u'name': u'TENNYSON, JACOB', u'sp': 2}],\n",
       " [{u'name': u'TENPIN/ALVIN HEALEY', u'sp': 4}],\n",
       " [{u'name': u'TEQUILA/', u'sp': 4}],\n",
       " [{u'name': u'TERMINATOR', u'sp': 4}],\n",
       " [{u'name': u'TERMINATOR II/PRINCE', u'sp': 4}],\n",
       " [{u'name': u'TERMINUS', u'sp': 2}],\n",
       " [{u'name': u'TERRAFORMER/SAM', u'sp': 4}],\n",
       " [{u'name': u'TERRAX', u'sp': 4}],\n",
       " [{u'name': u'TERRAX II/TYROS', u'sp': 2}],\n",
       " [{u'name': u'TERRAXIA', u'sp': 2}],\n",
       " [{u'name': u'TERREL, DEBORAH', u'sp': 4}],\n",
       " [{u'name': u'TERRIGENE', u'sp': 4}],\n",
       " [{u'name': u'TERROR/LASLO PEVELY', u'sp': 4}],\n",
       " [{u'name': u'TERROR II', u'sp': 2}],\n",
       " [{u'name': u'TESS-ONE', u'sp': 2}],\n",
       " [{u'name': u'TESSA', u'sp': 2}],\n",
       " [{u'name': u'TETHERBLOOD/', u'sp': 4}],\n",
       " [{u'name': u'TETHRA', u'sp': 4}],\n",
       " [{u'name': u'TEUTONIC KNIGHT/FRAN', u'sp': 4}],\n",
       " [{u'name': u'TEXAS TWISTER/DREW D', u'sp': 2}],\n",
       " [{u'name': u'TEZCATLIPOCA', u'sp': 2}],\n",
       " [{u'name': u'THAIS', u'sp': 4}],\n",
       " [{u'name': u'THAKOS', u'sp': 2}],\n",
       " [{u'name': u'THALLIUM', u'sp': 4}],\n",
       " [{u'name': u'THAMES, SERIPHA', u'sp': 4}],\n",
       " [{u'name': u'THAN, VELENA', u'sp': 4}],\n",
       " [{u'name': u'THANADEMOS', u'sp': 4}],\n",
       " [{u'name': u'THANE ECTOR', u'sp': 4}],\n",
       " [{u'name': u'THANOS', u'sp': 2}],\n",
       " [{u'name': u'THANOS DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'THENA', u'sp': 4}],\n",
       " [{u'name': u'THERA', u'sp': 4}],\n",
       " [{u'name': u'THERAK', u'sp': 2}],\n",
       " [{u'name': u'THERMAL MAN', u'sp': 4}],\n",
       " [{u'name': u'THERMITE/', u'sp': 4}],\n",
       " [{u'name': u'THERMO/DR. WALTER MI', u'sp': 2}],\n",
       " [{u'name': u'THERMO II/', u'sp': 4}],\n",
       " [{u'name': u'THERNON', u'sp': 4}],\n",
       " [{u'name': u'THIN MAN/BRUCE DICKS', u'sp': 4}],\n",
       " [{u'name': u'THING/BENJAMIN J. GR', u'sp': 2}],\n",
       " [{u'name': u'THING DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'THING DOPPELGANGER I', u'sp': 4}],\n",
       " [{u'name': u'THING DOPPELGANGER I', u'sp': 4}],\n",
       " [{u'name': u'THING DOPPELGANGER I', u'sp': 4}],\n",
       " [{u'name': u'THINGEE', u'sp': 4}],\n",
       " [{u'name': u'THINKER', u'sp': 2}],\n",
       " [{u'name': u'THOG', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, BECKY', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, COMMANDER DA', u'sp': 2}],\n",
       " [{u'name': u'THOMAS, DR. JOHN', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, DR. STAN', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, IDA', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, JEANIE', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, KIM HO TWAE', u'sp': 4}],\n",
       " [{u'name': u'THOMAS, ROY', u'sp': 4}],\n",
       " [{u'name': u'THOMPSON, EUGENE FLA', u'sp': 2}],\n",
       " [{u'name': u'THOMPSON, HARRISON', u'sp': 2}],\n",
       " [{u'name': u'THOMPSON, JESSICA JE', u'sp': 2}],\n",
       " [{u'name': u'THOMPSON, ROSIE', u'sp': 2}],\n",
       " [{u'name': u'THOR/DR. DONALD BLAK', u'sp': 2}],\n",
       " [{u'name': u'THOR II/ROGER RED NO', u'sp': 2}],\n",
       " [{u'name': u'THOR III DOPPELGANGE', u'sp': 2}],\n",
       " [{u'name': u'THOR III DOPPELGANGE', u'sp': 4}],\n",
       " [{u'name': u'THOR IV/DARGO', u'sp': 4}],\n",
       " [{u'name': u'THOR REPLICOID', u'sp': 4}],\n",
       " [{u'name': u'THOR | EARTH 253', u'sp': 4}],\n",
       " [{u'name': u'THOR | MUTANT X-VERS', u'sp': 4}],\n",
       " [{u'name': u'THORNN', u'sp': 2}],\n",
       " [{u'name': u'THORNN II/LUCIA CALL', u'sp': 4}],\n",
       " [{u'name': u'THORPE, GAVIN', u'sp': 2}],\n",
       " [{u'name': u'THORPE, GORDON', u'sp': 4}],\n",
       " [{u'name': u'THORPE, LUKE', u'sp': 2}],\n",
       " [{u'name': u'THORSON, DR. WALTER', u'sp': 2}],\n",
       " [{u'name': u'THOUSAND', u'sp': 2}],\n",
       " [{u'name': u'THRAXON', u'sp': 4}],\n",
       " [{u'name': u'THREADGOLD', u'sp': 4}],\n",
       " [{u'name': u'THREE-FACE', u'sp': 4}],\n",
       " [{u'name': u'THREETREES', u'sp': 4}],\n",
       " [{u'name': u'THRENODY', u'sp': 2}],\n",
       " [{u'name': u'THUG', u'sp': 2}],\n",
       " [{u'name': u'THULE, GEN.', u'sp': 2}],\n",
       " [{u'name': u'THUMBELLINA', u'sp': 4}],\n",
       " [{u'name': u'THUMPER', u'sp': 4}],\n",
       " [{u'name': u'THUNDERBALL/DR. ELIO', u'sp': 2}],\n",
       " [{u'name': u'THUNDERBIRD/JOHN PRO', u'sp': 4}],\n",
       " [{u'name': u'THUNDERBIRD II/JAMES', u'sp': 2}],\n",
       " [{u'name': u'THUNDERBIRD III/NEAL', u'sp': 2}],\n",
       " [{u'name': u'THUNDERBOLT/BILLY CA', u'sp': 4}],\n",
       " [{u'name': u'THUNDERBOLT II/LUIS', u'sp': 4}],\n",
       " [{u'name': u'THUNDERFIST/', u'sp': 4}],\n",
       " [{u'name': u'THUNDERHEAD/', u'sp': 4}],\n",
       " [{u'name': u'THUNDERSTRIKE/ERIC K', u'sp': 2}],\n",
       " [{u'name': u'THUNDERSWORD', u'sp': 4}],\n",
       " [{u'name': u'THUNDRA', u'sp': 2}],\n",
       " [{u'name': u'THURM, ETHAN', u'sp': 4}],\n",
       " [{u'name': u'TIAMAT', u'sp': 4}],\n",
       " [{u'name': u'TICKTOCK', u'sp': 4}],\n",
       " [{u'name': u'TIERS, MICHELLE', u'sp': 4}],\n",
       " [{u'name': u'TIGER SHARK/TODD ARL', u'sp': 2}],\n",
       " [{u'name': u'TIGRA/GREER NELSON', u'sp': 2}],\n",
       " [{u'name': u'TIKUAK', u'sp': 4}],\n",
       " [{u'name': u'TILBY, TRISH/PATRICI', u'sp': 2}],\n",
       " [{u'name': u'TILDA', u'sp': 4}],\n",
       " [{u'name': u'TILLIE THE HUN/MATIL', u'sp': 4}],\n",
       " [{u'name': u'TILTON, ROLAND R.', u'sp': 4}],\n",
       " [{u'name': u'TIMBERIUS', u'sp': 4}],\n",
       " [{u'name': u'TIMBERIUS II', u'sp': 4}],\n",
       " [{u'name': u'TIMEBOMB/LOUIS JOUBE', u'sp': 4}],\n",
       " [{u'name': u'TIMESHADOW', u'sp': 4}],\n",
       " [{u'name': u'TIMESLIP/RINA PATEL', u'sp': 4}],\n",
       " [{u'name': u'TIMESLOT', u'sp': 4}],\n",
       " [{u'name': u'TIMMONS', u'sp': 4}],\n",
       " [{u'name': u'TINAC', u'sp': 4}],\n",
       " [{u'name': u'TINKER, SHEA', u'sp': 2}],\n",
       " [{u'name': u'TINKERER', u'sp': 2}],\n",
       " [{u'name': u'TITAN', u'sp': 4}],\n",
       " [{u'name': u'TITAN, TRISH', u'sp': 4}],\n",
       " [{u'name': u'TITANIA/', u'sp': 2}],\n",
       " [{u'name': u'TITANIA II/MARY SKEE', u'sp': 2}],\n",
       " [{u'name': u'TITANIUM MAN/BORIS B', u'sp': 4}],\n",
       " [{u'name': u'TITANIUM MAN III/BOR', u'sp': 4}],\n",
       " [{u'name': u'TITHE COLLECTOR', u'sp': 4}],\n",
       " [{u'name': u'TIWAZ', u'sp': 4}],\n",
       " [{u'name': u'TOAD/MORTIMER TOYNBE', u'sp': 2}],\n",
       " [{u'name': u'TOBIAS', u'sp': 4}],\n",
       " [{u'name': u'TODD, FISHER', u'sp': 4}],\n",
       " [{u'name': u'TOFIELD, FRANCESCA', u'sp': 4}],\n",
       " [{u'name': u'TOI/REXEL TOIVEN', u'sp': 4}],\n",
       " [{u'name': u'TOKEN', u'sp': 4}],\n",
       " [{u'name': u'TOKKOTS', u'sp': 2}],\n",
       " [{u'name': u'TOL-NOK', u'sp': 4}],\n",
       " [{u'name': u'TOLOC', u'sp': 4}],\n",
       " [{u'name': u'TOLLIVER', u'sp': 4}],\n",
       " [{u'name': u'TOLLIVER, EMMA', u'sp': 4}],\n",
       " [{u'name': u'TOLLIVER, MELBA', u'sp': 2}],\n",
       " [{u'name': u'TOLLIVER, REV. JACKS', u'sp': 2}],\n",
       " [{u'name': u'TOLLIVER, SHERIFF JO', u'sp': 4}],\n",
       " [{u'name': u'TOM THUMB/THOMAS THO', u'sp': 2}],\n",
       " [{u'name': u'TOMAZOOMA', u'sp': 4}],\n",
       " [{u'name': u'TOMAZOOMA II', u'sp': 4}],\n",
       " [{u'name': u'TOMBSTONE/LONNIE THO', u'sp': 2}],\n",
       " [{u'name': u'TOMMY LIGHTNING/', u'sp': 4}],\n",
       " [{u'name': u'TOMORROW HAWK/CEYOTE', u'sp': 4}],\n",
       " [{u'name': u'TONGAH', u'sp': 2}],\n",
       " [{u'name': u'TOOTHGRINDER', u'sp': 4}],\n",
       " [{u'name': u'TOOTHGNASHER', u'sp': 4}],\n",
       " [{u'name': u'TOPAZ', u'sp': 2}],\n",
       " [{u'name': u'TOPSPIN/DARREN MITCH', u'sp': 4}],\n",
       " [{u'name': u'TORES', u'sp': 4}],\n",
       " [{u'name': u'TORG', u'sp': 4}],\n",
       " [{u'name': u'TORGO', u'sp': 4}],\n",
       " [{u'name': u'TORK, LT.', u'sp': 2}],\n",
       " [{u'name': u'TORK, SGT.', u'sp': 2}],\n",
       " [{u'name': u'TORO/TOM RAYMOND', u'sp': 2}],\n",
       " [{u'name': u'TORO II/BENITO SERRA', u'sp': 4}],\n",
       " [{u'name': u'TORPEDO', u'sp': 4}],\n",
       " [{u'name': u'TORPEDO II/MICHAEL S', u'sp': 4}],\n",
       " [{u'name': u'TORPEDO III/BROCK JO', u'sp': 2}],\n",
       " [{u'name': u'TORQUE II', u'sp': 4}],\n",
       " [{u'name': u'TOSHI', u'sp': 4}],\n",
       " [{u'name': u'TOTEM', u'sp': 4}],\n",
       " [{u'name': u'TOUGH LOVE/', u'sp': 4}],\n",
       " [{u'name': u'TOWER', u'sp': 4}],\n",
       " [{u'name': u'TOWER, BLAKE', u'sp': 2}],\n",
       " [{u'name': u'TOWNSEND, CHRIS', u'sp': 2}],\n",
       " [{u'name': u'TOY', u'sp': 2}],\n",
       " [{u'name': u'TRACER', u'sp': 2}],\n",
       " [{u'name': u'TRACKER', u'sp': 4}],\n",
       " [{u'name': u'TRADER', u'sp': 4}],\n",
       " [{u'name': u'TRAINER, DR. SEWARD', u'sp': 2}],\n",
       " [{u'name': u'TRANTRA', u'sp': 4}],\n",
       " [{u'name': u'TRAPPER/VOLA', u'sp': 4}],\n",
       " [{u'name': u'TRAPSTER/PETER PETRU', u'sp': 2}],\n",
       " [{u'name': u'TRAPSTER II/LARRY CU', u'sp': 4}],\n",
       " [{u'name': u'TRASK', u'sp': 4}],\n",
       " [{u'name': u'TRASK, DR. BOLIVAR', u'sp': 4}],\n",
       " [{u'name': u'TRASK, DR. DONALD TR', u'sp': 4}],\n",
       " [{u'name': u'TRASK, LAWRENCE LARR', u'sp': 4}],\n",
       " [{u'name': u'TRASK, RAYMOND', u'sp': 2}],\n",
       " [{u'name': u'TRAUMA', u'sp': 4}],\n",
       " [{u'name': u'TRAVELER', u'sp': 4}],\n",
       " [{u'name': u'TRAVELLER, DR. JUDAS', u'sp': 2}],\n",
       " [{u'name': u'TRAVERS, MIKE', u'sp': 4}],\n",
       " [{u'name': u'TRAYNOR, HARLEY', u'sp': 4}],\n",
       " [{u'name': u'TREMELO/', u'sp': 4}],\n",
       " [{u'name': u'TREMONT, JONATHAN', u'sp': 4}],\n",
       " [{u'name': u'TREVANE, DET. CONNOR', u'sp': 2}],\n",
       " [{u'name': u'TREVANI, DANIKA', u'sp': 4}],\n",
       " [{u'name': u'TREVOR, STEVE', u'sp': 4}],\n",
       " [{u'name': u'TREVORIK', u'sp': 4}],\n",
       " [{u'name': u'TRI-SENTINEL', u'sp': 2}],\n",
       " [{u'name': u'TRIATHLON/DELROY GAR', u'sp': 2}],\n",
       " [{u'name': u'TRIAX', u'sp': 4}],\n",
       " [{u'name': u'TRICKSHOT', u'sp': 4}],\n",
       " [{u'name': u'TRICKSTER', u'sp': 4}],\n",
       " [{u'name': u'TRIMPE, HERB', u'sp': 4}],\n",
       " [{u'name': u'TRION', u'sp': 4}],\n",
       " [{u'name': u'TRITON', u'sp': 2}],\n",
       " [{u'name': u'TRITON DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'TRITON DOPPELGANGER,', u'sp': 4}],\n",
       " [{u'name': u'TRITON | MUTANT X-VE', u'sp': 4}],\n",
       " [{u'name': u'TROLL/', u'sp': 2}],\n",
       " [{u'name': u'TRUMP/', u'sp': 4}],\n",
       " [{u'name': u'TRUTH', u'sp': 2}],\n",
       " [{u'name': u'TRUTH II', u'sp': 4}],\n",
       " [{u'name': u'TRYKUR', u'sp': 4}],\n",
       " [{u'name': u'TSERRON', u'sp': 4}],\n",
       " [{u'name': u'TSKAROV, GENERAL', u'sp': 4}],\n",
       " [{u'name': u'TSO, JASON', u'sp': 4}],\n",
       " [{u'name': u'TSUNG, MARCUS', u'sp': 4}],\n",
       " [{u'name': u'TSURAYABA, MATSUO', u'sp': 4}],\n",
       " [{u'name': u'TU', u'sp': 4}],\n",
       " [{u'name': u'TUATARA/COMMANDER AR', u'sp': 4}],\n",
       " [{u'name': u'TUC', u'sp': 4}],\n",
       " [{u'name': u'TULAK', u'sp': 4}],\n",
       " [{u'name': u'TULL', u'sp': 4}],\n",
       " [{u'name': u'TULLY, DEREK', u'sp': 4}],\n",
       " [{u'name': u'TUMBLER/JOHN ROBERT,', u'sp': 4}],\n",
       " [{u'name': u'TUMOLO, DR. JOANNE', u'sp': 4}],\n",
       " [{u'name': u'TUNDRA', u'sp': 4}],\n",
       " [{u'name': u'TUNGSTEN', u'sp': 4}],\n",
       " [{u'name': u'TUPA', u'sp': 4}],\n",
       " [{u'name': u'TURBO II (A)/MICHIKO', u'sp': 2}],\n",
       " [{u'name': u'TURBO II (B)/MIKE JE', u'sp': 4}],\n",
       " [{u'name': u'TURK', u'sp': 2}],\n",
       " [{u'name': u'TURK II', u'sp': 4}],\n",
       " [{u'name': u'TURMOIL', u'sp': 4}],\n",
       " [{u'name': u'TUSK', u'sp': 4}],\n",
       " [{u'name': u'TUTINAX', u'sp': 4}],\n",
       " [{u'name': u'TUVO', u'sp': 4}],\n",
       " [{u'name': u'TWAKI, DR. TED', u'sp': 2}],\n",
       " [{u'name': u'TWEEDLEDOPE', u'sp': 4}],\n",
       " [{u'name': u'TWIT', u'sp': 2}],\n",
       " [{u'name': u'TWO-GUN KID', u'sp': 2}],\n",
       " [{u'name': u'TYCHO', u'sp': 2}],\n",
       " [{u'name': u'TYGER TIGER/JESSAN H', u'sp': 4}],\n",
       " [{u'name': u'TYGER, LORD', u'sp': 4}],\n",
       " [{u'name': u'TYGERSTRYKE/', u'sp': 4}],\n",
       " [{u'name': u'TYN-DARMUTH', u'sp': 4}],\n",
       " [{u'name': u'TYNDAR', u'sp': 4}],\n",
       " [{u'name': u'TYNE, ELIZABETH/JANI', u'sp': 4}],\n",
       " [{u'name': u'TYPEFACE/GORDON THOM', u'sp': 2}],\n",
       " [{u'name': u'TYPHOID MARY/MARY ME', u'sp': 2}],\n",
       " [{u'name': u'TYPHOID MARY | MUTAN', u'sp': 4}],\n",
       " [{u'name': u'TYPHON', u'sp': 4}],\n",
       " [{u'name': u'TYPHOON/', u'sp': 6}],\n",
       " [{u'name': u'TYR', u'sp': 4}],\n",
       " [{u'name': u'TYRAK', u'sp': 4}],\n",
       " [{u'name': u'TYRANNUS', u'sp': 2}],\n",
       " [{u'name': u'TYRANT', u'sp': 4}],\n",
       " [{u'name': u'TYRUS', u'sp': 4}],\n",
       " [{u'name': u'TYRUS KRILL', u'sp': 4}],\n",
       " [{u'name': u'U-GO GIRL/EDIE', u'sp': 4}],\n",
       " [{u'name': u'U-MAN/MERRANO', u'sp': 4}],\n",
       " [{u'name': u'UATU', u'sp': 2}],\n",
       " [{u'name': u'UATU | MUTANT X-VERS', u'sp': 4}],\n",
       " [{u'name': u'UGLY JOHN/STEVE', u'sp': 4}],\n",
       " [{u'name': u'ULARA', u'sp': 4}],\n",
       " [{u'name': u'ULIK', u'sp': 2}],\n",
       " [{u'name': u'ULTARNT', u'sp': 4}],\n",
       " [{u'name': u'ULTIMA', u'sp': 4}],\n",
       " [{u'name': u'ULTIMATOR/', u'sp': 4}],\n",
       " [{u'name': u'ULTIMO', u'sp': 4}],\n",
       " [{u'name': u'ULTIMUS', u'sp': 4}],\n",
       " [{u'name': u'ULTRA-MAX', u'sp': 4}],\n",
       " [{u'name': u'ULTRON', u'sp': 2}],\n",
       " [{u'name': u'ULTRON 2010', u'sp': 4}],\n",
       " [{u'name': u'ULYSSES', u'sp': 6}],\n",
       " [{u'name': u'ULYSSES II', u'sp': 2}],\n",
       " [{u'name': u'UMAR', u'sp': 4}],\n",
       " [{u'name': u'UNA', u'sp': 4}],\n",
       " [{u'name': u'UNBEING/BILLY BETELH', u'sp': 4}],\n",
       " [{u'name': u'UNCEGILA', u'sp': 4}],\n",
       " [{u'name': u'UNCLE PYKO', u'sp': 4}],\n",
       " [{u'name': u'UNCLE SAM', u'sp': 4}],\n",
       " [{u'name': u'UNDERTAKER/CONRAD EI', u'sp': 2}],\n",
       " [{u'name': u'UNDERTOW', u'sp': 4}],\n",
       " [{u'name': u'UNI-LORD', u'sp': 4}],\n",
       " [{u'name': u'UNICORN/MYLOS MASARY', u'sp': 2}],\n",
       " [{u'name': u'UNICORN II/', u'sp': 4}],\n",
       " [{u'name': u'UNICORN III/', u'sp': 4}],\n",
       " [{u'name': u'UNION JACK/LORD MONT', u'sp': 4}],\n",
       " [{u'name': u'UNION JACK II/BRIAN,', u'sp': 4}],\n",
       " [{u'name': u'UNION JACK III/JOEY,', u'sp': 2}],\n",
       " [{u'name': u'UNIT', u'sp': 6}],\n",
       " [{u'name': u'UNIT 101101', u'sp': 4}],\n",
       " [{u'name': u'UNSEEN/UNAM', u'sp': 4}],\n",
       " [{u'name': u'UNUS THE UNTOUCHABLE', u'sp': 2}],\n",
       " [{u'name': u'UNUSCIONE', u'sp': 4}],\n",
       " [{u'name': u'UPLINK/HECTOR FUENTE', u'sp': 4}],\n",
       " [{u'name': u'UR-LINI', u'sp': 4}],\n",
       " [{u'name': u'URANIUM', u'sp': 2}],\n",
       " [{u'name': u'URCHALLA', u'sp': 4}],\n",
       " [{u'name': u'URICH, BEN', u'sp': 2}],\n",
       " [{u'name': u'URICH, DORIS', u'sp': 2}],\n",
       " [{u'name': u'UROC', u'sp': 2}],\n",
       " [{u'name': u'URSA MAJOR/MIKHAIL U', u'sp': 2}],\n",
       " [{u'name': u'URSON-WELLZ', u'sp': 4}],\n",
       " [{u'name': u'URSULA', u'sp': 4}],\n",
       " [{u'name': u'URSULA, LADY', u'sp': 4}],\n",
       " [{u'name': u'URTHONA', u'sp': 4}],\n",
       " [{u'name': u'USAGENT/CAPTAIN JOHN', u'sp': 2}],\n",
       " [{u'name': u'USAGENT DOPPELGANGER', u'sp': 2}],\n",
       " [{u'name': u'UTGARD-LOKI', u'sp': 4}],\n",
       " [{u'name': u'VACUUM', u'sp': 2}],\n",
       " [{u'name': u'VAGABOND/PRISCILLA L', u'sp': 4}],\n",
       " [{u'name': u'VAGUE/', u'sp': 4}],\n",
       " [{u'name': u'VAKUME', u'sp': 2}],\n",
       " [{u'name': u'VALERIA', u'sp': 4}],\n",
       " [{u'name': u'VALINOR', u'sp': 2}],\n",
       " [{u'name': u'VALKIN', u'sp': 4}],\n",
       " [{u'name': u'VALKYRIE II | MUTANT', u'sp': 4}],\n",
       " [{u'name': u'VALKYRIE IV', u'sp': 4}],\n",
       " [{u'name': u'VALTORR', u'sp': 4}],\n",
       " [{u'name': u'VAMP', u'sp': 4}],\n",
       " [{u'name': u'VAN HELSING, RACHEL', u'sp': 4}],\n",
       " [{u'name': u'VAN NUYS, PROF. RODE', u'sp': 4}],\n",
       " [{u'name': u'VANADIUM', u'sp': 4}],\n",
       " [{u'name': u'VANCE REBUS/', u'sp': 4}],\n",
       " [{u'name': u'VANDERGILL, GEORGE', u'sp': 2}],\n",
       " [{u'name': u'VANE, ROGER', u'sp': 4}],\n",
       " [{u'name': u'VANESSA', u'sp': 4}],\n",
       " [{u'name': u'VANGUARD/NICOLAI KRY', u'sp': 2}]]"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relations(\"SPIDER-MAN/PETER PAR\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "6486"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run('''\n",
    "MATCH (c: character) \n",
    "WITH COUNT(c) as nbChar\n",
    "RETURN nbChar \n",
    "''').data()[0][u'nbChar']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def relations(nomduPerso):\n",
    "    maList=[]\n",
    "    \n",
    "    nbPersos = graph.run('''\n",
    "    MATCH (c: character) \n",
    "    WITH COUNT(c) as nbChar\n",
    "    RETURN nbChar \n",
    "    ''').data()[0][u'nbChar']\n",
    "    \n",
    "    for index in range(nbPersos):\n",
    "        maList.append(\n",
    "        graph.run('''\n",
    "        MATCH p =shortestPath((n1: character{name: {N}})-[r *..6]-(n2: character{number: {I}}))\n",
    "        WITH length(p) as sp, n2.name as name\n",
    "        RETURN sp, name ''',{\"I\":str(index+1), \"N\":nomduPerso}).data())\n",
    "        \n",
    "    newList = [item for sublist in maList for  item in sublist]\n",
    "    return sorted(newList, key=lambda dic: dic[u'sp'])\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "global name 'graph' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-2-16bd64c71611>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mrelations\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"SPIDER-MAN/PETER PAR\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m<ipython-input-1-17afffb5acf7>\u001b[0m in \u001b[0;36mrelations\u001b[0;34m(nomduPerso)\u001b[0m\n\u001b[1;32m      2\u001b[0m     \u001b[0mmaList\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 4\u001b[0;31m     nbPersos = graph.run('''\n\u001b[0m\u001b[1;32m      5\u001b[0m     \u001b[0mMATCH\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mc\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mcharacter\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      6\u001b[0m     \u001b[0mWITH\u001b[0m \u001b[0mCOUNT\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mc\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mnbChar\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: global name 'graph' is not defined"
     ]
    }
   ],
   "source": [
    "relations(\"SPIDER-MAN/PETER PAR\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
